{
  "backend/main.mo": "Main Motoko actor for the Quantumoney backend, implementing user profile management, vQMY bonus claiming, and access control using mixins for blob storage and authorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing each component's purpose and recent changes.",
  "frontend/ANDROID_BUILD_GUIDE.md": "Step-by-step guide for building and submitting the Quantumoney AR Android AAB to the Google Play Store, covering prerequisites, keystore generation, build configuration, and troubleshooting.",
  "frontend/android-build-config.json": "Android build configuration file specifying package name, version, SDK targets, keystore settings, required permissions, hardware features, and Google Play Store metadata for Quantumoney AR.",
  "frontend/android-build.sh": "Bash script that checks prerequisites (Node.js, pnpm, Java, Android SDK), builds the web app, syncs with Capacitor, and generates either a release AAB or debug APK for the Quantumoney AR Android app.",
  "frontend/BUILD_INSTRUCTIONS.md": "Brief quick-start guide for building the web application for mobile deployment.",
  "frontend/build-mobile.sh": "Bash script that builds the web app, initializes Capacitor platforms if needed, syncs assets, and builds Android (AAB/APK) and/or iOS packages based on platform and build-type arguments.",
  "frontend/build-native-interactive.sh": "Interactive bash script that checks prerequisites and presents a menu to build Android AAB/APK, iOS IPA/debug, both platforms, initialize Capacitor, or view build status.",
  "frontend/build-native-packages.sh": "One-command bash script with a numbered menu that delegates to android-build.sh and ios-build.sh to produce release or debug packages for Android and/or iOS, running first-time Capacitor setup if platforms are absent.",
  "frontend/build-native.sh": "Bash script offering a simple menu to build Android AAB, iOS IPA, both platforms, or initialize a Capacitor project by installing dependencies and adding Android/iOS platforms.",
  "frontend/CAPACITOR_NATIVE_BUILD_GUIDE.md": "Comprehensive guide for generating native Android AAB and iOS IPA packages using Capacitor 6+, including prerequisites, step-by-step build instructions, and store submission details.",
  "frontend/CAPACITOR_SETUP.md": "Guide for initializing the Capacitor 6+ native mobile project for Quantumoney AR, transforming the PWA into Android and iOS applications.",
  "frontend/capacitor-init.sh": "Bash script that installs Capacitor 6+ dependencies, builds the web app, initializes the Capacitor project with package ID app.quantumoneyar.qmy, and adds/syncs Android (and iOS on macOS) platforms.",
  "frontend/capacitor-plugins.json": "Lists all required and optional Capacitor plugins (camera, geolocation, storage, etc.) with versions, descriptions, required permissions, and installation commands for the Quantumoney AR mobile app.",
  "frontend/capacitor.config.json": "Capacitor configuration for the Quantumoney AR app defining app ID, web directory, server URL, plugin settings (SplashScreen, StatusBar, Geolocation, Camera), and platform-specific Android/iOS options.",
  "frontend/CONTROLLER_CONSOLIDATION_PATCH.md": "Document providing CLI commands and a verification checklist for adding a controller Principal to existing ICP canisters.",
  "frontend/DEPLOYMENT_STATUS.md": "Status report confirming Quantumoney AR is ready for native mobile packaging via Capacitor 6+, detailing architecture, compatibility, and configuration.",
  "frontend/DEPLOYMENT.md": "Mobile deployment guide covering PWA configuration, Android deployment via TWA or Capacitor, and APK signing and Play Store submission steps.",
  "frontend/DEVICE_TESTING_REPORT.md": "Template for recording device testing results across Android and iOS, covering authentication, camera/AR, GPS, wallet, DAO, and UI functionality.",
  "frontend/EXPORT_INSTRUCTIONS.md": "Quick export guide for generating Android APK and iOS packages, listing prerequisites and a one-command build approach.",
  "frontend/FINAL_BUILD_DELIVERY_REPORT.md": "Final delivery report summarizing the complete native mobile build infrastructure for Quantumoney AR, with prerequisites checklists and execution instructions for Android and iOS builds.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light and dark theme design tokens (colors, borders, chart colors, sidebar) using the OKLCH color space.",
  "frontend/index.html": "Main HTML entry point for the Quantumoney AR PWA, including viewport/PWA meta tags, service worker registration with update detection, and a deferred PWA install prompt handler.",
  "frontend/install-test-devices.sh": "Interactive bash script providing a menu to install Android AAB/APK or iOS IPA builds onto real connected devices and run test suites, using tools like adb and bundletool.",
  "frontend/install-test.sh": "Bash script with a simple menu to test Android AAB (via bundletool), debug APK, or iOS IPA installations on connected devices, including a manual testing checklist after installation.",
  "frontend/IOS_BUILD_GUIDE.md": "Guide for building and submitting the Quantumoney AR iOS IPA to the Apple App Store using Capacitor 6+.",
  "frontend/ios-build-config.json": "iOS build configuration specifying bundle identifier, version, deployment target, required permissions (camera, location, photos), App Store metadata, and screenshot size requirements for Quantumoney AR.",
  "frontend/ios-build.sh": "Bash script for building the Quantumoney AR iOS IPA on macOS, checking prerequisites (Node.js, pnpm, Xcode, CocoaPods), building the web app, syncing Capacitor, and guiding release or debug archive creation.",
  "frontend/MOBILE_BUILD_DELIVERY_REPORT.md": "Delivery report confirming that all Capacitor 6+ build scripts, configuration files, and documentation for generating Android AAB and iOS IPA packages for Quantumoney AR (Build 200) are complete and ready for store submission.",
  "frontend/MOBILE_BUILD_GUIDE.md": "Step-by-step guide for generating native Android APK and iOS packages for Quantumoney AR, listing required software prerequisites including Node.js, Android Studio, Xcode, and Capacitor CLI.",
  "frontend/MOBILE_EXPORT_DELIVERY.md": "Delivery report summarizing all configuration files and build scripts created for native mobile packaging of Quantumoney AR via Capacitor 6+, targeting Android AAB (Google Play) and iOS IPA (App Store) with an estimated 2-3 day build timeline.",
  "frontend/NATIVE_BUILD_COMPLETE_GUIDE.md": "Comprehensive step-by-step guide covering prerequisites, Android AAB generation, iOS IPA generation, data persistence verification, device testing, store submission, and troubleshooting for Quantumoney AR native builds.",
  "frontend/NATIVE_BUILD_COMPLETE.md": "Guide providing complete instructions and software prerequisites for generating native Android AAB and iOS IPA packages for Quantumoney AR (Build 200) using Capacitor 6+.",
  "frontend/NATIVE_BUILD_DELIVERY_FINAL.md": "Final delivery report confirming complete readiness of the Quantumoney AR PWA for native mobile packaging via Capacitor 6+, with all infrastructure and configurations in place for immediate build execution.",
  "frontend/NATIVE_BUILD_DELIVERY_REPORT.md": "Delivery report detailing the complete native mobile packaging infrastructure for Quantumoney AR, including Capacitor configuration, Android/iOS build systems, data persistence architecture, and store compliance verification.",
  "frontend/NATIVE_BUILD_EXECUTION_REPORT.md": "Detailed execution report documenting all infrastructure components for Quantumoney AR's Capacitor 6+ native builds, including configuration files, build scripts (capacitor-init.sh, android-build.sh, ios-build.sh), and their purposes and outputs.",
  "frontend/NATIVE_MOBILE_BUILD_INSTRUCTIONS.md": "Complete build instructions guide for generating Android AAB and iOS IPA packages from the Quantumoney AR PWA using Capacitor 6+, covering quick start, step-by-step builds, device testing, and store submission.",
  "frontend/NATIVE_MOBILE_PACKAGING_GUIDE.md": "Packaging guide for Quantumoney AR describing the hybrid Capacitor 6+ architecture, prerequisites for Android and iOS builds, and key native features such as camera, GPS, and offline functionality.",
  "frontend/NATIVE_PACKAGING_WORKFLOW.md": "Workflow guide for generating Android AAB and iOS IPA packages for Quantumoney AR (Build 200), including prerequisite tables, architecture confirmation, and a full troubleshooting and timeline section.",
  "frontend/public/CNAME": "GitHub Pages custom domain configuration file pointing to quantumoney.github.io.",
  "frontend/public/data/qmy_spots.geojson": "GeoJSON FeatureCollection defining global QMY token spawn locations (e.g., Lisbon, Madrid, Tokyo) with per-spot max token limits and per-wallet cooldown rules.",
  "frontend/public/docs/index.json": "JSON index of the Quantumoney AR documentation site listing six sections (getting started, gameplay, tokenomics, DAO, technical, mobile) with their URLs and external links.",
  "frontend/public/manifest.json": "PWA web app manifest for Quantumoney AR defining app metadata, icons, display mode, theme colors, and shortcuts for the AR Camera and Profile pages.",
  "frontend/public/map/index.html": "Standalone HTML page that loads a Leaflet-based world map for visualizing QMY spawn locations, with a loading overlay and references to map.css and map.js.",
  "frontend/public/map/map.css": "CSS stylesheet for the full-viewport Leaflet spawn map, including safe-area insets for iOS, a pulsing user-location marker animation, gold-accented zoom controls, and a loading overlay.",
  "frontend/public/map/map.js": "JavaScript module that initializes a Leaflet map with OpenStreetMap tiles, tracks the user's GPS position, renders coin and monster spawn markers with state from localStorage, and listens for postMessage location updates from a parent window.",
  "frontend/public/service-worker.js": "Service worker implementing a network-first caching strategy with precaching of essential assets, old-cache cleanup on activation, offline fallback to cached responses, and a SKIP_WAITING message handler.",
  "frontend/QUICK_BUILD_INSTRUCTIONS.md": "Fast-track checklist and quick-reference guide for native Android AAB and iOS IPA builds, pointing to the full guide in NATIVE_BUILD_COMPLETE_GUIDE.md for detailed instructions.",
  "frontend/QUICK_BUILD_REFERENCE.md": "One-page quick reference listing prerequisites and quick-start commands for native mobile builds across Android and iOS platforms.",
  "frontend/QUICK_START_NATIVE.md": "Minimal quick-start guide providing one-command build instructions for generating Android AAB and iOS IPA packages for Quantumoney AR.",
  "frontend/README_MOBILE_EXPORT.md": "Overview README confirming the Quantumoney AR app is ready for mobile export, listing prerequisites and pointing to a one-command build process for Android and iOS.",
  "frontend/src/App.tsx": "Root application component that manages routing between sections via URL paths, wraps the app in multiple context providers, and gates access behind a legal acceptance modal.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with five icon-based nav items (Home, AR Camera, Map, Profile, QA) that highlights the active section in gold.",
  "frontend/src/components/compliance/VisualSimulationNotice.tsx": "A compliance alert banner that informs users the screen shows visual-only simulation data with no real cryptocurrency transactions, per app store guidelines.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying social media links (Facebook, X, Instagram, LinkedIn) with gold hover styling and an 'By HTgamers' credit.",
  "frontend/src/components/gameplay/GameplayHUD.tsx": "A fixed heads-up display overlay showing real-time gameplay stats including XP, meters walked, nearby spawns count, and optional AR detection status.",
  "frontend/src/components/gameplay/TransparentRuleModal.tsx": "A reusable dialog modal supporting 'rules' and 'congratulations' variants, with scrollable content, confirm/cancel actions, and an optional share button.",
  "frontend/src/components/gameplay/UniverseBackdrop.tsx": "A fixed full-screen background component that renders an animated universe GIF at reduced opacity as a decorative backdrop.",
  "frontend/src/components/GoldenPaperIcon.tsx": "Empty file with no content.",
  "frontend/src/components/GoldenPaperOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Fixed top header with a logo, language selector dropdown, optional refresh button, and an authentication dropdown showing account info or login/logout actions.",
  "frontend/src/components/LegalModal.tsx": "Modal dialog that requires users to grant camera and location permissions and check off terms, privacy, cookies, and age confirmation before proceeding.",
  "frontend/src/components/monsters/monsterCatalog.ts": "Empty file with no content.",
  "frontend/src/components/monsters/MonsterCollection.tsx": "Empty file with no content.",
  "frontend/src/components/profile/ConceptualAllocationsPlaceholders.tsx": "Displays four placeholder token allocation cards (Pre-Sale, Team, Founders, Advisors) with amounts and percentages, clearly labeled as conceptual/visual simulation only.",
  "frontend/src/components/profile/GameplayHistoryMiniMap.tsx": "Renders a canvas-based mini-map plotting gameplay history events by GPS coordinates, color-coded by event type (coins, monsters, XP), with a fallback empty state.",
  "frontend/src/components/profile/RecentActivityBanner.tsx": "A transient activity banner that displays the most recent gameplay event (collect, capture, or level-up) with an icon, disappearing after 10 seconds.",
  "frontend/src/components/sections/ARCamera.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ARScreen.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ARView.tsx": "Empty file with no content.",
  "frontend/src/components/sections/BCQPanel.tsx": "Empty file with no content.",
  "frontend/src/components/sections/BetaQAChecklist.tsx": "A QA checklist component for beta testing that auto-detects status of terms flow, UI, and technical checks using localStorage and DOM inspection, with manual override support and export/copy/download functionality.",
  "frontend/src/components/sections/Bridge.tsx": "Empty file with no content.",
  "frontend/src/components/sections/Burn.tsx": "A token burn dashboard component displaying QMY burn history, supply metrics, and charts, with an admin burn form and canister ID references; requires Internet Identity login to view.",
  "frontend/src/components/sections/CameraAR/arMath.ts": "Utility functions for AR math: computing geographic bearing between two points, normalizing angle differences, and projecting a bearing to a screen X position within a given field of view.",
  "frontend/src/components/sections/CameraAR/CameraARActionBar.tsx": "A bottom action bar component for the AR camera view providing Lock and Unlock buttons with loading states and balance display.",
  "frontend/src/components/sections/CameraAR/CameraARControls.tsx": "A camera control component rendering a Start/Stop Camera toggle button positioned at the bottom center of the AR view.",
  "frontend/src/components/sections/CameraAR/CameraARPage.tsx": "The main AR camera page component that integrates geolocation, device heading, camera feed, visible AR object filtering, and coin lock/unlock interactions with user feedback messages.",
  "frontend/src/components/sections/CameraAR/OverlayLayer.tsx": "Renders AR overlay sprites for visible game objects (coins, monsters) projected onto the camera view based on bearing and user heading, with lock state indicators.",
  "frontend/src/components/sections/CameraAR/sprites.ts": "Maps MockSpawn object types to their corresponding sprite image asset paths.",
  "frontend/src/components/sections/CameraAR/tolerance.ts": "Returns an angular tolerance (in degrees) for AR object visibility based on the user's XP level.",
  "frontend/src/components/sections/CameraAR/useArVisibility.ts": "A React hook that filters all AR spawn objects to those within the user's XP-based radius and angular field of view given their position and heading.",
  "frontend/src/components/sections/CameraAR/useDeviceHeading.ts": "A React hook that reads device compass heading from the DeviceOrientation API (with iOS permission support and webkit fallback), throttled to 100ms updates.",
  "frontend/src/components/sections/ChatRoom.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ComingSoon.tsx": "A placeholder component displayed for unfinished sections ('map' or 'ar') that shows a construction icon, localized section title, and a button to navigate back to the home/hud section.",
  "frontend/src/components/sections/CoverPage.tsx": "A full-screen landing/cover page for the Quantumoney game featuring an animated universe background, logo, coin animation, and an 'Enter Game' button that navigates to the HUD section.",
  "frontend/src/components/sections/DAOStructure.tsx": "A DAO governance UI with two tabs: a proposals list showing mock voting data with status badges and vote counts, and a community chat panel with mock messages and a message input field.",
  "frontend/src/components/sections/EconomicModel.tsx": "Displays the 'Quantum Yield' economic model page with APY stats, a flow diagram image, and cards explaining staking pools, holder benefits, and liquidity mechanics in Portuguese.",
  "frontend/src/components/sections/GameArchitecture.tsx": "Presents the technical architecture of the AR game across five tabs (overview, components, data flow, diagram, MVP), describing the integration of AR mobile, ICP blockchain, and decentralized governance layers.",
  "frontend/src/components/sections/GlobalDistribution.tsx": "Shows token distribution data including geographic allocation across regions, pre-sale phases, distribution pools, and vesting schedules, all using mock/visual-simulation data with progress bars and badges.",
  "frontend/src/components/sections/GlobalStatus.tsx": "Displays global game statistics including registered players, planted/burned/redeemed QMY tokens, a daily XP line chart, a QMY distribution pie chart, and a top-10 player leaderboard using mock data.",
  "frontend/src/components/sections/GoldPaper.tsx": "An empty file with no content or exports.",
  "frontend/src/components/sections/GoogleMaps.tsx": "An empty file with no content or exports.",
  "frontend/src/components/sections/HomeSpaceBackground.tsx": "Animated canvas background component that renders scrolling stars, floating planets, comets, and falling QMY/ICP coin images for the home screen.",
  "frontend/src/components/sections/HUD.tsx": "Heads-up display component that handles user authentication, welcome bonus claiming/modal display, music toggle, and an animated starfield canvas background.",
  "frontend/src/components/sections/Introduction.tsx": "Static informational section presenting the Quantumoney (QMY) project's mission, vision, core values, and competitive differentials using card-based layout.",
  "frontend/src/components/sections/Inventory.tsx": "Player inventory page showing mock creatures, items, and achievements in a tabbed UI, requiring Internet Identity authentication to display content.",
  "frontend/src/components/sections/LeafletMap.tsx": "Map component that embeds a Leaflet/OpenStreetMap via an iframe with a loading spinner and an info overlay, requiring authentication to access.",
  "frontend/src/components/sections/LeafletMapPage.tsx": "Full gameplay map page that integrates geolocation, simulated location, nearby spawns, walking meters, and a GameplayHUD overlay over an iframe-based Leaflet map.",
  "frontend/src/components/sections/LeafletWorldMap.tsx": "Empty file with no content.",
  "frontend/src/components/sections/legal/HowItWorks.tsx": "React component that renders the 'How It Works' legal page using content from legalContent.ts, displaying sections with titles and text/list content inside a scrollable area.",
  "frontend/src/components/sections/legal/Mission.tsx": "React component that renders the Mission legal page, structurally identical to HowItWorks but sourcing content from missionContent in legalContent.ts.",
  "frontend/src/components/sections/legal/PrivacyPolicy.tsx": "React component that renders the Privacy Policy page using privacyContent from legalContent.ts, displaying versioned sections in a scrollable layout.",
  "frontend/src/components/sections/legal/Terms.tsx": "React component that renders the Terms of Service page using termsContent from legalContent.ts, with the same scrollable section layout as other legal pages.",
  "frontend/src/components/sections/MapLibreWorld.tsx": "Wrapper component that renders StaticWorldMap for authenticated users or an authentication-required card for unauthenticated users.",
  "frontend/src/components/sections/MapMundo.tsx": "Empty file with no content.",
  "frontend/src/components/sections/MapMundoLeaflet.tsx": "React component that renders a Leaflet map inside an iframe by setting its src to '/map/index.html' on mount, with scrollable full-height layout.",
  "frontend/src/components/sections/MapView.tsx": "Empty file with no content or exports.",
  "frontend/src/components/sections/MarketAnalysis.tsx": "Displays a market analysis section with competitor data, market growth bar charts, and key metrics cards (total market, target market, participation goal) for the Quantumoney project.",
  "frontend/src/components/sections/MundoMap.tsx": "Empty file with no content or exports.",
  "frontend/src/components/sections/Partnerships.tsx": "Renders a partnerships page listing six partner cards with categories and descriptions, plus a strategy overview section with DeFi, infrastructure, and ecosystem categories.",
  "frontend/src/components/sections/Profile.tsx": "User profile page that displays authenticated player stats (XP, captured monsters, locked coins), a vesting progress bar, and tabbed sections, requiring Internet Identity login.",
  "frontend/src/components/sections/Roadmap.tsx": "Renders a project roadmap with six quarterly phases (Q4 2025–2027+), each showing status icons and milestone items with color-coded cards for completed, current, and upcoming phases.",
  "frontend/src/components/sections/RulesTutorial.tsx": "Tutorial page with three tabs (Basics, QMY Coins, AR Camera) explaining how to play the Quantumoney AR game, including onboarding, coin locking/unlocking mechanics, and vesting schedule.",
  "frontend/src/components/sections/StaticWorldMap.tsx": "Renders a static world map with overlaid player marker and spawn markers (coins/monsters) based on simulated location, with toggleable layers and location controls.",
  "frontend/src/components/sections/SWAP.tsx": "Empty file with no content or exports.",
  "frontend/src/components/sections/TableOfContents.tsx": "Displays a navigable grid of cards linking to the main app sections (AR Camera, World Map, Profile, Rules & Tutorial).",
  "frontend/src/components/sections/TechnicalAppendix.tsx": "Shows a tabbed technical appendix with mathematical formulas (staking rewards, burn rate, voting power, dynamic APY), specifications, and security details in Portuguese.",
  "frontend/src/components/sections/Technology.tsx": "Presents a tabbed overview of the project's blockchain technology stack (ICP, smart contracts, interoperability, scalability) with stats and descriptions in Portuguese.",
  "frontend/src/components/sections/Tokenomics.tsx": "Displays token distribution (pie chart), release schedule (line chart), and burn mechanism data using Recharts, with tabbed navigation.",
  "frontend/src/components/sections/Vesting.tsx": "Dedicated vesting page showing a 700M QMY token unlock schedule with progress charts, a table of upcoming unlock dates/hashes, and canister ID copy utilities.",
  "frontend/src/components/sections/Wallet.tsx": "Empty file with no content.",
  "frontend/src/components/SideDrawer.tsx": "Slide-in side drawer (Sheet) listing gameplay and informational navigation items, with a logout button shown when the user is authenticated.",
  "frontend/src/components/TermsModal.tsx": "Full-screen terms-of-service modal that requires the user to scroll to the bottom before the Accept button is enabled, storing acceptance in local storage.",
  "frontend/src/components/VestingBanner.tsx": "Empty file with no content.",
  "frontend/src/components/wallet/QmySendReceive.tsx": "Wallet UI component providing tabbed Send and Receive forms for QMY tokens via Login ID, currently UI-only/simulated using useSendQmy and useReceiveQmy hooks with toast notifications.",
  "frontend/src/components/WalletHUD.tsx": "Empty file with no content.",
  "frontend/src/components/WelcomeBanner.tsx": "Empty file with no content.",
  "frontend/src/components/WelcomeBonusModal.tsx": "A modal component that displays a welcome bonus of 1,000 QMY to new users, showing unlocked (100 QMY) and locked/vesting (900 QMY) amounts with a vesting schedule breakdown.",
  "frontend/src/content/legalContent.ts": "Defines TypeScript interfaces and static content objects (terms, privacy, mission, how-it-works) for all legal pages, including versioned sections with string or list content.",
  "frontend/src/contexts/GameStateContext.tsx": "React context provider that fetches and exposes player state and bonus data from the ICP backend actor, computing balance and unlock info with auto-refresh on focus and storage events.",
  "frontend/src/contexts/GeolocationContext.tsx": "React context provider that manages browser geolocation permission state, position tracking via watchPosition, and error handling with user-friendly messages.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for language switching (English/Portuguese) with a full translation dictionary and a `t()` lookup function.",
  "frontend/src/contexts/ProximitySettingsContext.tsx": "React context that stores and persists the player's proximity radius setting (10 or 20 meters) to localStorage.",
  "frontend/src/contexts/SimulatedLocationContext.tsx": "React context that provides a fake GPS location with preset cities, directional movement, and sessionStorage persistence for testing AR gameplay without real GPS.",
  "frontend/src/gameplay/audio/useSfx.ts": "Custom hook that plays short sound effects (collect, spawn, levelup, capture) via the Web Audio API with mute support.",
  "frontend/src/gameplay/bonus/registrationBonus.ts": "Calculates a 1000 QMY registration bonus schedule that unlocks 100 initially and 100 more each month over 9 months based on a registration timestamp.",
  "frontend/src/gameplay/density/buildDensityZones.ts": "Groups spawn spots into 0.5-degree grid buckets and returns colored density zones (green/yellow/red) normalized to the maximum bucket count.",
  "frontend/src/gameplay/fx/SpawnCollectFX.tsx": "Renders a temporary full-screen visual effect overlay for spawn, collect, or level-up events, auto-dismissing after 1–2 seconds.",
  "frontend/src/gameplay/history/types.ts": "Defines TypeScript types for gameplay history events and computed player statistics.",
  "frontend/src/gameplay/history/useGameplayHistory.ts": "Custom hook that maintains a per-user gameplay event log (up to 100 entries) persisted to localStorage, with add and clear operations.",
  "frontend/src/gameplay/progression/leveling.ts": "Utility functions for calculating player level, XP progress percentage, level-up detection, and a rank label from XP using a simple 100-XP-per-level formula.",
  "frontend/src/gameplay/spots/spotTaxonomy.ts": "Defines the five spot types (unlocked coin, locked coin, common/rare/legendary creature) with their labels, colors, icon paths, and XP rewards.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useArActions.ts": "Provides React Query mutation hooks for locking and unlocking coins via the backend actor, invalidating relevant queries on success.",
  "frontend/src/hooks/useArInteractions.ts": "Exposes helper callbacks to check if a coin is locked or a monster is captured based on the current player state from GameStateContext.",
  "frontend/src/hooks/useBetaQaChecklistOverrides.ts": "Manages persistent beta QA checklist status overrides stored in localStorage, providing set, clear, and reset operations.",
  "frontend/src/hooks/useGeolocation.ts": "Re-exports the geolocation context hook from GeolocationContext as a named hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY's AuthClient, providing a React context and hook with login, logout, and identity state management.",
  "frontend/src/hooks/usePlayerState.ts": "Fetches and caches the authenticated user's canister-backed PlayerState using React Query, keyed by principal.",
  "frontend/src/hooks/usePlugWallet.ts": "Empty file with no implementation.",
  "frontend/src/hooks/usePrototypeDetection.ts": "Performs frame-by-frame motion and brightness variance analysis on a video element to produce a simple object detection confidence score.",
  "frontend/src/hooks/useQmySync.ts": "Provides React Query hooks for fetching and mutating Quantumoney.app sync data (balances, send/receive), keyed by the user's principal.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for player state, user profile, and bonus/vesting data, plus a legacy QMY sync adapter derived from player state.",
  "frontend/src/hooks/useShareReward.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useVisualRewardSimulation.ts": "Simulates a vesting reward schedule based on the user's registration timestamp stored in localStorage, calculating unlocked/locked amounts and next unlock date.",
  "frontend/src/hooks/useWalkingMeters.ts": "React hook that tracks total meters walked using GPS coordinates, filtering out jitter (< 1m), GPS jumps (> 10 m/s), and throttling updates to every 2 seconds.",
  "frontend/src/i18n/config.ts": "Empty i18n configuration file, likely a placeholder for internationalization setup.",
  "frontend/src/i18n/locales/en.json": "English locale strings for the Quantumoney AR app, covering UI labels for header, navigation, camera, map, monsters, and common actions.",
  "frontend/src/i18n/locales/es.json": "Empty Spanish locale file, likely a placeholder for future translations.",
  "frontend/src/i18n/locales/pt.json": "Portuguese locale strings for the Quantumoney AR app, including translations for header, navigation, camera, map, monsters, Plug Wallet, and general UI.",
  "frontend/src/index.css": "Global CSS file using Tailwind with OKLCH-based design tokens for light/dark modes, mobile-safe area utilities, glass card styles, and responsive container helpers.",
  "frontend/src/lib/arInteractionsStore.ts": "Non-authoritative localStorage cache for AR coin lock/unlock states, providing mirror functions and a subscription mechanism for change events.",
  "frontend/src/lib/haversine.ts": "Utility library implementing the Haversine formula to calculate distances between geographic coordinates in meters or kilometers, and check proximity within a radius.",
  "frontend/src/lib/mockGameplayState.ts": "localStorage-backed gameplay state manager for tracking collected coins, captured monsters, and interacted spots per identity, with optional canister-backed PlayerState as authoritative override.",
  "frontend/src/lib/mockSpawns.ts": "Defines mock AR spawn data (coins and monsters) around Évora and Lisboa, Portugal, with a Haversine-based utility to filter spawns within a given radius.",
  "frontend/src/lib/qmyApi.ts": "Mocked QMY API client that manages user balances, XP, and bonus history using localStorage, providing deterministic registration bonuses and sync data for frontend-only testing.",
  "frontend/src/lib/qmyLocking.ts": "Handles QMY coin locking logic with 30-day lock durations, resolving matured locks by awarding rewards and applying XP penalties via localStorage-backed state.",
  "frontend/src/lib/termsAcceptance.ts": "Centralized utility for tracking Terms acceptance state in localStorage under a single canonical key, with support for migrating legacy acceptance keys.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/utils/conceptualWallet.ts": "Generates a deterministic wallet ID from a principal using SHA-256 hashing and provides placeholder transaction data for visual display.",
  "frontend/src/utils/qaChecklistExport.ts": "Builds and exports QA checklist reports as JSON, supporting clipboard copy and file download with pass/fail/pending totals.",
  "frontend/src/utils/share.ts": "Share helper that attempts the Web Share API first, then falls back to clipboard copy for sharing title, text, and URL content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with CSS variable-based colors, custom border radii, Inter font, gold box shadows, responsive breakpoints, safe-area spacing, and plugins for animations, typography, and container queries.",
  "frontend/TECHNICAL_VERIFICATION_REPORT.md": "Technical verification report analyzing Quantumoney AR's three-tier data persistence architecture (ICP canisters, localStorage, Capacitor Storage) and confirming store compatibility for native mobile packaging.",
  "project_state.json": "Project state tracker for QuantumMoneyAR (quantumoneyar.app), documenting the app's AR coin/monster gameplay concept, known issues (inactive AR lock/unlock buttons), and seven pending feature requests covering AR interactions, map state sync, footer adjustments, and Caffeine attribution removal.",
  "unknown.txt": "Portuguese-language design document outlining the game's detailed flows (login, collection, governance, transactions), MVP feature set, backend data structures (player profiles, game config, governance), and main backend operations for an ICP blockchain-based AR game."
}