{
  "backend/main.mo": "Main actor for the Quantumoney backend, handling user profiles, bonus/token claiming, player state (monsters, coin locks, XP, action history), and access control using mixins for blob storage and authorization.",
  "backend/migration.mo": "Defines the data migration module that maps OldActor state to NewActor state, preserving all fields including bonuses, user profiles, principal mappings, and game state collections.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their associated frontend files, component dependencies, test IDs, and confidence levels for the Quantumoney AR project.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-line summaries of each frontend source file, describing the purpose and key functionality of each component, hook, and page.",
  "frontend/ANDROID_BUILD_GUIDE.md": "Step-by-step guide for building and submitting the Quantumoney AR app to the Google Play Store, covering prerequisites, keystore generation, AAB building, and store submission.",
  "frontend/android-build-config.json": "JSON configuration file specifying Android build parameters for Quantumoney AR, including package name, SDK versions, keystore settings, permissions, and Google Play Store metadata.",
  "frontend/android-build.sh": "Bash script that automates the Android build process for Quantumoney AR, checking prerequisites, building the web app, syncing Capacitor, and producing a release AAB or debug APK via Gradle.",
  "frontend/BUILD_INSTRUCTIONS.md": "Brief quick-start build instructions for mobile deployment of the frontend web application.",
  "frontend/build-mobile.sh": "Bash script for building native Android and iOS packages for Quantumoney AR, supporting platform selection and debug/release build types with Capacitor sync and Gradle/Xcode invocation.",
  "frontend/build-native-interactive.sh": "Interactive menu-driven bash script for Quantumoney AR that checks prerequisites and lets users select Android AAB, iOS IPA, or combined platform builds.",
  "frontend/build-native-packages.sh": "All-in-one bash script providing a menu to build Android AAB, Android APK, iOS IPA, or both platforms for Quantumoney AR, delegating to platform-specific build scripts.",
  "frontend/build-native.sh": "Interactive bash script providing a menu to build Android AAB, iOS IPA, or both native packages for Quantumoney AR, and optionally initialize a Capacitor project.",
  "frontend/CAPACITOR_NATIVE_BUILD_GUIDE.md": "Comprehensive guide for generating native Android AAB and iOS IPA packages using Capacitor 6+, including prerequisites, build steps, testing, and store submission for Quantumoney AR.",
  "frontend/CAPACITOR_SETUP.md": "Setup guide for initializing Capacitor 6+ in the Quantumoney AR project to convert the PWA into native Android and iOS applications.",
  "frontend/capacitor-init.sh": "Bash script that installs Capacitor 6+ dependencies, builds the web app, initializes the Capacitor project, and adds Android (and optionally iOS) platforms.",
  "frontend/capacitor-plugins.json": "JSON manifest listing all required and optional Capacitor 6 plugins for the Quantumoney AR app, including their versions, descriptions, and required permissions.",
  "frontend/capacitor.config.json": "Capacitor configuration file defining the app ID, web directory, server settings, plugin options (SplashScreen, StatusBar, Geolocation, Camera), and Android/iOS platform-specific settings.",
  "frontend/CONTROLLER_CONSOLIDATION_PATCH.md": "Documents manual CLI commands and a verification checklist for adding a controller Principal to existing ICP canisters.",
  "frontend/DEPLOYMENT_STATUS.md": "Status report confirming Quantumoney AR is ready for native mobile packaging via Capacitor 6+, detailing the hybrid app architecture, tech stack, and completed Capacitor configuration.",
  "frontend/DEPLOYMENT.md": "Mobile deployment guide covering PWA configuration, Android deployment via TWA or Capacitor, and Google Play Store submission steps for Quantumoney AR.",
  "frontend/DEVICE_TESTING_REPORT.md": "A template checklist for QA testers to document device information and test results across Android/iOS for Quantumoney AR build 200, covering installation, camera/AR, GPS, wallet, DAO, and UI functionality.",
  "frontend/EXPORT_INSTRUCTIONS.md": "A quick-start guide outlining prerequisites and a one-command build process for generating Android APK and iOS packages for Quantumoney AR.",
  "frontend/FINAL_BUILD_DELIVERY_REPORT.md": "A delivery report confirming all build infrastructure (scripts, configs, docs) is ready for Quantumoney AR v1.0.0 build 200, with step-by-step instructions for a developer to execute Android AAB and iOS IPA generation.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light and dark theme design tokens including colors, borders, and sidebar variables.",
  "frontend/index.html": "Main HTML entry point that sets up PWA metadata, links the manifest and icons, loads Leaflet CSS, mounts the React app, and registers a service worker with install prompt handling.",
  "frontend/install-test-devices.sh": "Bash script with an interactive menu for installing and testing Quantumoney AR on real Android and iOS devices, supporting AAB installation via bundletool, debug APK via ADB, and iOS IPA via Xcode.",
  "frontend/install-test.sh": "Bash script for testing Quantumoney AR native app installations on real devices, supporting Android AAB, Android debug APK, and iOS IPA with interactive menu options and post-install checklists.",
  "frontend/IOS_BUILD_GUIDE.md": "A concise iOS build guide for submitting Quantumoney AR build 200 to the Apple App Store, including a one-command build entry point.",
  "frontend/ios-build-config.json": "iOS build configuration for Quantumoney AR specifying bundle ID, version, deployment target, required permissions (camera, location, photos), capabilities, and App Store metadata.",
  "frontend/ios-build.sh": "Bash script for building the Quantumoney AR iOS IPA on macOS, handling prerequisite checks, web build, Capacitor sync, CocoaPods install, and opening Xcode for release archiving or running a debug build.",
  "frontend/MOBILE_BUILD_DELIVERY_REPORT.md": "An executive delivery report confirming all Capacitor 6+ build scripts and configuration files are complete and ready for generating Google Play Store AAB and Apple App Store IPA packages for Quantumoney AR build 200.",
  "frontend/MOBILE_BUILD_GUIDE.md": "A step-by-step guide covering prerequisites and setup for generating native Android APK and iOS packages for Quantumoney AR using Capacitor CLI.",
  "frontend/MOBILE_EXPORT_DELIVERY.md": "A delivery report listing all configuration files and build scripts created for Capacitor 6+ native mobile packaging of Quantumoney AR, targeting Android AAB and iOS IPA with an estimated 2–3 day build timeline.",
  "frontend/NATIVE_BUILD_COMPLETE_GUIDE.md": "A comprehensive step-by-step guide covering prerequisites, Android AAB generation, iOS IPA generation, data persistence verification, device testing, store submission, and troubleshooting for Quantumoney AR via Capacitor 6+.",
  "frontend/NATIVE_BUILD_COMPLETE.md": "A complete guide detailing prerequisites, software requirements, and expected build output paths for generating Android AAB and iOS IPA packages for Quantumoney AR build 200.",
  "frontend/NATIVE_BUILD_DELIVERY_FINAL.md": "A final delivery report confirming complete readiness of Quantumoney AR's Capacitor 6+ infrastructure for immediate Android AAB and iOS IPA build execution.",
  "frontend/NATIVE_BUILD_DELIVERY_REPORT.md": "A detailed delivery report enumerating all infrastructure components—Capacitor config, build scripts, data persistence architecture, store compliance, and documentation—ready for Quantumoney AR native mobile packaging.",
  "frontend/NATIVE_BUILD_EXECUTION_REPORT.md": "An execution report documenting all Capacitor 6+ infrastructure components including configuration files, build scripts (capacitor-init.sh, android-build.sh, ios-build.sh), and their purposes and outputs for Quantumoney AR build 200.",
  "frontend/NATIVE_MOBILE_BUILD_INSTRUCTIONS.md": "A complete instruction guide with table of contents covering Android AAB and iOS IPA generation, device testing, data persistence verification, store submission, and troubleshooting for Quantumoney AR using Capacitor 6+.",
  "frontend/NATIVE_MOBILE_PACKAGING_GUIDE.md": "A packaging guide describing the Capacitor 6+ hybrid app architecture (React PWA wrapping ICP canisters) and providing full prerequisites and steps for building Android AAB and iOS IPA packages for Quantumoney AR.",
  "frontend/NATIVE_PACKAGING_WORKFLOW.md": "Comprehensive guide for generating Android AAB and iOS IPA packages from the Quantumoney AR PWA using Capacitor 6+, covering prerequisites, architecture details, and store submission steps.",
  "frontend/public/CNAME": "GitHub Pages CNAME file pointing the custom domain to quantumoney.github.io.",
  "frontend/public/data/qmy_spots.geojson": "GeoJSON FeatureCollection defining global QMY coin spawn locations (e.g., Lisbon, Madrid, Tokyo) with per-spot limits of 4000 QMY, a per-wallet claim limit of 1, and a 24-hour cooldown.",
  "frontend/public/docs/index.json": "Documentation index for Quantumoney AR listing six documentation sections (getting started, gameplay, tokenomics, DAO, technical, mobile) with their URLs and external links.",
  "frontend/public/manifest.json": "PWA web app manifest for Quantumoney AR defining app name, icons, display mode, theme colors, and shortcuts for the AR Camera and Profile sections.",
  "frontend/public/map/index.html": "HTML entry point for the Quantumoney AR world spawn visualization map, loading Leaflet.js and custom map assets with a loading overlay.",
  "frontend/public/map/map.css": "CSS stylesheet for the full-viewport Leaflet spawn map, including safe-area insets for iOS, a pulsing user location marker, gold-accented zoom controls, and a loading overlay style.",
  "frontend/public/map/map.js": "Implements a Leaflet-based map with GPS player tracking, coin/monster spawn markers, and AR state sync via localStorage. Renders interactive popups and updates marker icons based on locked/captured status.",
  "frontend/public/service-worker.js": "PWA service worker that precaches essential app assets, uses a network-first with cache fallback fetch strategy, and cleans up old caches on activation.",
  "frontend/QUICK_BUILD_INSTRUCTIONS.md": "Fast-track checklist and abbreviated instructions for building native Android and iOS packages for Quantumoney AR, referencing the full guide for details.",
  "frontend/QUICK_BUILD_REFERENCE.md": "One-page quick reference listing prerequisites and quick-start commands for building Quantumoney AR on Android and iOS platforms.",
  "frontend/QUICK_START_NATIVE.md": "Minimal quick-start guide focused on one-command builds for generating Android AAB and iOS IPA for Quantumoney AR.",
  "frontend/README_MOBILE_EXPORT.md": "Overview document confirming the Quantumoney AR app is ready for mobile export, listing prerequisites and pointing to a one-command build process for Android and iOS.",
  "frontend/src/App.tsx": "Root React component that manages client-side routing via URL path mapping, renders the active section, wraps the app in context providers, and gates access behind a legal acceptance modal.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with five icon buttons (Home, AR Camera, Map, Profile, QA) that highlight the active section and trigger navigation callbacks.",
  "frontend/src/components/compliance/VisualSimulationNotice.tsx": "A small alert banner that disclaims the screen as a visual-only simulation with no real cryptocurrency transactions, for app store compliance purposes.",
  "frontend/src/components/Footer.tsx": "Footer component displaying social share links (WhatsApp, X, Telegram, Instagram) and an ICP branding badge with a 'Powered by ICP' label.",
  "frontend/src/components/gameplay/GameplayHUD.tsx": "A fixed overlay card displaying real-time gameplay stats including XP, meters walked, nearby spawns count, and optional AR detection status.",
  "frontend/src/components/gameplay/TransparentRuleModal.tsx": "A reusable dialog modal with scrollable content supporting two variants ('rules' and 'congratulations'), optional share button, and configurable confirm/cancel actions.",
  "frontend/src/components/gameplay/UniverseBackdrop.tsx": "A fixed full-screen background component that renders a dimmed animated GIF universe backdrop with no pointer interaction.",
  "frontend/src/components/GoldenPaperIcon.tsx": "Empty file with no content.",
  "frontend/src/components/GoldenPaperOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Fixed top header with a hamburger menu, logo, language selector dropdown, balance refresh button, and an authenticated user dropdown showing profile info and logout.",
  "frontend/src/components/LegalModal.tsx": "Modal dialog that requires users to grant camera and location permissions and check off terms, privacy, cookies, and age confirmation checkboxes before proceeding into the app.",
  "frontend/src/components/monsters/monsterCatalog.ts": "Empty file with no content.",
  "frontend/src/components/monsters/MonsterCollection.tsx": "Empty file with no content.",
  "frontend/src/components/profile/ConceptualAllocationsPlaceholders.tsx": "Displays a grid of four placeholder token allocation cards (Pre-Sale, Team, Founders, Advisors) with amounts and percentages, clearly labeled as conceptual/visual simulation only.",
  "frontend/src/components/profile/GameplayHistoryMiniMap.tsx": "Renders a canvas-based mini-map of gameplay history events with location data, plotting colored markers for different event types (coins, monsters, XP) on a grid.",
  "frontend/src/components/profile/RecentActivityBanner.tsx": "Displays a transient banner card showing the most recent gameplay activity (collect, capture, or level-up) for 10 seconds after it occurs.",
  "frontend/src/components/sections/ARCamera.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ARScreen.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ARView.tsx": "Empty file with no content.",
  "frontend/src/components/sections/BCQPanel.tsx": "Empty file with no content.",
  "frontend/src/components/sections/BetaQAChecklist.tsx": "Provides a QA checklist UI for beta testing that auto-detects status of terms flow, UI, and technical checks, and supports manual overrides, notes, and export/copy/download of the report.",
  "frontend/src/components/sections/Bridge.tsx": "Empty file with no content.",
  "frontend/src/components/sections/Burn.tsx": "Displays QMY token burn statistics, history table, and charts, and provides an admin burn form; requires Internet Identity login to view.",
  "frontend/src/components/sections/CameraAR/arMath.ts": "Utility functions for AR math: calculates compass bearing between two GPS coordinates, normalizes angle differences, and projects a bearing to a screen X position within a given field of view.",
  "frontend/src/components/sections/CameraAR/CameraARActionBar.tsx": "Renders a fixed action bar for AR interactions, allowing authenticated users to lock/unlock nearby coins or capture nearby monsters, recording XP events in gameplay history.",
  "frontend/src/components/sections/CameraAR/CameraARControls.tsx": "Renders start/stop camera toggle buttons for the AR camera view with loading state support.",
  "frontend/src/components/sections/CameraAR/CameraARPage.tsx": "Main AR camera page that composes the camera feed, AR overlay of nearby spawns, gameplay HUD, action bar, and camera controls, requiring user authentication to access.",
  "frontend/src/components/sections/CameraAR/OverlayLayer.tsx": "React component that renders AR overlay sprites for visible game objects (coins and monsters) positioned horizontally on screen based on bearing calculations, with visual states for locked coins and captured monsters.",
  "frontend/src/components/sections/CameraAR/sprites.ts": "Maps MockSpawn object types to their corresponding sprite image asset paths for use in the AR overlay.",
  "frontend/src/components/sections/CameraAR/tolerance.ts": "Returns an angular tolerance value (in degrees) for AR visibility based on the player's XP level, scaling from 10° to 20°.",
  "frontend/src/components/sections/CameraAR/useArVisibility.ts": "Custom hook that filters all game objects to those within the player's XP-based radius and angular field of view relative to their heading, returning the visible subset.",
  "frontend/src/components/sections/CameraAR/useDeviceHeading.ts": "Custom hook that reads device compass heading from the DeviceOrientation API (with iOS permission support and webkit fallback), throttled to 100ms updates.",
  "frontend/src/components/sections/ChatRoom.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ComingSoon.tsx": "Placeholder page component displayed for sections not yet implemented, showing a construction icon and a button to navigate back to the HUD.",
  "frontend/src/components/sections/CoverPage.tsx": "Landing/splash page for the Quantumoney game featuring an animated background, logo, floating coin, and an 'Enter Game' button that navigates to the HUD.",
  "frontend/src/components/sections/DAOStructure.tsx": "DAO governance page with two tabs: a proposals list showing mock voting data with status badges and vote counts, and a simple chat room with mock messages and a message input.",
  "frontend/src/components/sections/EconomicModel.tsx": "Static informational page describing the Quantum Yield economic model, displaying APY stats, staking pool details, and participant benefit cards with icons.",
  "frontend/src/components/sections/GameArchitecture.tsx": "Renders a tabbed UI section describing the technical architecture of the Quantumoney AR game, covering system overview, components, data flow, diagrams, and MVP across five tabs with cards and badges.",
  "frontend/src/components/sections/GlobalDistribution.tsx": "Displays a tabbed section showing QMY token geographic distribution, pre-sale phases, distribution pools, and vesting schedules using progress bars, badges, and mock simulation data.",
  "frontend/src/components/sections/GlobalStatus.tsx": "Shows global game statistics including registered players, planted/burned QMY tokens, a daily XP line chart, a QMY distribution pie chart, and a top-10 player leaderboard using mock data.",
  "frontend/src/components/sections/GoldPaper.tsx": "Empty file with no content or exports.",
  "frontend/src/components/sections/GoogleMaps.tsx": "Empty file with no content or exports.",
  "frontend/src/components/sections/HomeSpaceBackground.tsx": "Renders an animated HTML canvas background featuring scrolling stars, floating planets, comets, and falling QMY/ICP coin images to create a space-themed visual effect for the home screen.",
  "frontend/src/components/sections/HUD.tsx": "Main home/HUD screen component that handles Internet Identity login/logout, auto-claims a welcome bonus for new users, displays user profile info, and renders the space background with a welcome modal.",
  "frontend/src/components/sections/Introduction.tsx": "Renders the Quantumoney whitepaper introduction section with mission, vision, core values (Security, Transparency, Innovation), and competitive differentials using cards and gradient styling.",
  "frontend/src/components/sections/Inventory.tsx": "Displays a tabbed inventory UI for authenticated users showing mock creatures (with rarity), items, and achievements; redirects unauthenticated users to a login prompt.",
  "frontend/src/components/sections/LeafletMap.tsx": "Embeds a Leaflet/OpenStreetMap via iframe for authenticated users, showing a loading spinner until the map loads and an info overlay card on top.",
  "frontend/src/components/sections/LeafletMapPage.tsx": "Full gameplay map page that combines a Leaflet iframe with GPS/simulated location, posts player location updates to the iframe, and overlays GameplayHUD and UniverseBackdrop components.",
  "frontend/src/components/sections/LeafletWorldMap.tsx": "Empty file with no content.",
  "frontend/src/components/sections/legal/HowItWorks.tsx": "Renders a scrollable 'How It Works' legal/informational page by mapping over sections from the imported `howItWorksContent` data object.",
  "frontend/src/components/sections/legal/Mission.tsx": "Renders a scrollable Mission page by mapping over sections from the imported `missionContent` data object, following the same layout pattern as other legal pages.",
  "frontend/src/components/sections/legal/PrivacyPolicy.tsx": "Renders a scrollable Privacy Policy page by mapping over sections from the imported `privacyContent` data object with yellow-accented headings on a black background.",
  "frontend/src/components/sections/legal/Terms.tsx": "Renders a scrollable Terms of Service page by mapping over sections from the imported `termsContent` data object, sharing the same layout as other legal section components.",
  "frontend/src/components/sections/MapLibreWorld.tsx": "Authentication-gated wrapper that renders StaticWorldMap for logged-in users or an alert card prompting login for unauthenticated users.",
  "frontend/src/components/sections/MapMundo.tsx": "Empty file with no content.",
  "frontend/src/components/sections/MapMundoLeaflet.tsx": "Renders a Leaflet map iframe and syncs AR interaction state to it by posting messages on load and on localStorage changes.",
  "frontend/src/components/sections/MapView.tsx": "Empty file with no content.",
  "frontend/src/components/sections/MarketAnalysis.tsx": "Renders a whitepaper market analysis section with KPI cards, a bar chart of DeFi/metaverse market growth, and a competitor comparison table using Recharts.",
  "frontend/src/components/sections/MundoMap.tsx": "Empty file with no content.",
  "frontend/src/components/sections/Partnerships.tsx": "Displays the Quantumoney partnerships page with a strategy overview (DeFi, Infrastructure, Ecosystem categories) and a grid of six partner cards with names, categories, and descriptions.",
  "frontend/src/components/sections/Profile.tsx": "User profile section showing player stats, vesting schedule, and tabbed views (overview, vesting, monsters, coins) with support for editing display name and uploading a profile photo via Internet Identity.",
  "frontend/src/components/sections/Roadmap.tsx": "Renders a quarterly roadmap timeline for Quantumoney from Q4 2025 through 2027+, with status icons and color-coded cards indicating completed, current, and upcoming phases.",
  "frontend/src/components/sections/RulesTutorial.tsx": "Tabbed tutorial page explaining the Quantumoney AR game across three tabs: Basics, QMY Coins, and AR Camera, each with icon-labeled instruction cards.",
  "frontend/src/components/sections/StaticWorldMap.tsx": "Renders a static world map image with overlaid player and spawn markers (coins/monsters), layer toggles, and simulated location controls using mock spawn data.",
  "frontend/src/components/sections/SWAP.tsx": "Empty file with no content or exports.",
  "frontend/src/components/sections/TableOfContents.tsx": "Displays a navigable grid of app sections (AR Camera, World Map, Profile, Rules & Tutorial) as clickable cards that route to the corresponding section via an onNavigate callback.",
  "frontend/src/components/sections/TechnicalAppendix.tsx": "Displays a technical appendix section with tabbed content covering mathematical formulas (staking rewards, burn rate, voting power, dynamic APY) along with specifications and security details, styled with amber/gold theming.",
  "frontend/src/components/sections/Technology.tsx": "Renders the Technology section describing the ICP blockchain infrastructure with tabs for Blockchain, Smart Contracts, Interoperability, and Scalability, including key metrics like 2s transaction finality.",
  "frontend/src/components/sections/Tokenomics.tsx": "Shows token distribution (pie chart), release schedule (line chart), and burn mechanism using Recharts, with data covering 5 allocation categories and a 36-month vesting timeline.",
  "frontend/src/components/sections/Vesting.tsx": "Dedicated vesting dashboard displaying 700M QMY token unlock schedule across 12 monthly tranches from Feb 2026, with progress charts, canister IDs, and clipboard copy functionality.",
  "frontend/src/components/sections/Wallet.tsx": "Empty file with no content or exports.",
  "frontend/src/components/SideDrawer.tsx": "A slide-out navigation drawer component that renders gameplay and informational menu items, handles section navigation, and provides a logout button for authenticated users.",
  "frontend/src/components/TermsModal.tsx": "A modal that displays scrollable terms of service content on first visit, requiring the user to scroll to the bottom before enabling the Accept button, and persists acceptance to local storage.",
  "frontend/src/components/VestingBanner.tsx": "Empty file with no content.",
  "frontend/src/components/wallet/QmySendReceive.tsx": "React component providing a tabbed UI for sending and receiving QMY tokens by Login ID, using mutation hooks and displaying toast notifications. Currently UI-only/simulated with no real token transfers.",
  "frontend/src/components/WalletHUD.tsx": "Empty file with no content.",
  "frontend/src/components/WelcomeBanner.tsx": "Empty file with no content.",
  "frontend/src/components/WelcomeBonusModal.tsx": "A modal displayed after registration that shows the welcome bonus breakdown (100 QMY unlocked, 900 QMY vesting over 9 months, +100 XP) and invalidates relevant React Query caches on close.",
  "frontend/src/content/legalContent.ts": "Defines TypeScript interfaces and static content for the app's Terms of Service and Privacy Policy, including sections on eligibility, acceptable use, data collection, and location data.",
  "frontend/src/contexts/GameStateContext.tsx": "React context that aggregates player state and bonus data from backend queries, exposing balances, unlock info, and a refresh function with auto-refresh on window focus.",
  "frontend/src/contexts/GeolocationContext.tsx": "React context managing browser geolocation permission, position tracking via watchPosition, and error handling with user-friendly messages for denied/unavailable states.",
  "frontend/src/contexts/LanguageContext.tsx": "React context providing English and Portuguese translations via a key-based lookup function, with language preference persisted and exposed through a custom hook.",
  "frontend/src/contexts/ProximitySettingsContext.tsx": "React context that stores and persists the user's proximity radius setting (10 or 20 meters) in localStorage, exposing it via a custom hook.",
  "frontend/src/contexts/SimulatedLocationContext.tsx": "React context providing a simulated GPS location with preset cities, directional movement, and sessionStorage persistence, used as a fallback when real geolocation is unavailable.",
  "frontend/src/gameplay/audio/useSfx.ts": "React hook that provides sound effect playback for gameplay events (collect, spawn, levelup, capture) using the Web Audio API, with mute/unmute support and silent failure handling.",
  "frontend/src/gameplay/bonus/registrationBonus.ts": "Calculates a registration bonus schedule where 1000 tokens unlock over 9 months (100 initially, 100/month), returning unlock progress, dates, and percentage based on a registration timestamp in nanoseconds.",
  "frontend/src/gameplay/density/buildDensityZones.ts": "Groups geographic spots into 0.5-degree grid cells and returns density zones with normalized density values and color-coded bounds (green/yellow/red) for map overlay rendering.",
  "frontend/src/gameplay/fx/SpawnCollectFX.tsx": "React component that displays a temporary fullscreen visual effect (spawn, collect, or levelup) using a particle image and auto-dismisses after 1–2 seconds.",
  "frontend/src/gameplay/history/types.ts": "Defines TypeScript types for gameplay history events (coin-collect, creature-capture, level-up, bonus-unlock) and computed player stats aggregates.",
  "frontend/src/gameplay/history/useGameplayHistory.ts": "React hook that manages a per-user gameplay event history (up to 100 events) persisted to localStorage, with add and clear operations.",
  "frontend/src/gameplay/progression/leveling.ts": "Provides XP-based leveling utilities including level calculation (100 XP per level), level-up detection, progress percentage, and a rank label derived from XP thresholds.",
  "frontend/src/gameplay/spots/spotTaxonomy.ts": "Defines the unified taxonomy of spot types (coin-unlocked, coin-locked, creature variants) with associated labels, colors, icon paths, and XP rewards for AR and map rendering.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useArActions.ts": "Provides React Query mutations for locking and unlocking coins via the backend actor, updating the local AR interactions store and invalidating relevant queries on success.",
  "frontend/src/hooks/useArInteractions.ts": "Hook that exposes coin-locked and monster-captured state by syncing the local AR interactions store with the latest backend player state, falling back to the local cache.",
  "frontend/src/hooks/useBetaQaChecklistOverrides.ts": "Hook that manages versioned beta QA checklist status overrides (pass/fail/pending with notes) persisted to localStorage, with set, clear, and reset operations.",
  "frontend/src/hooks/useGeolocation.ts": "Thin re-export wrapper that exposes the GeolocationContext hook as a named useGeolocation hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP blockchain, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/usePlayerState.ts": "React Query hook that fetches the current player's state from the backend canister actor.",
  "frontend/src/hooks/usePlugWallet.ts": "Empty file with no implementation.",
  "frontend/src/hooks/usePrototypeDetection.ts": "Hook that performs frame-by-frame motion and brightness variance detection on a video element using a hidden canvas, returning a confidence score and detected boolean.",
  "frontend/src/hooks/useQmySync.ts": "React Query hooks for fetching and mutating Quantumoney (QMY) sync data via an external API, including send and receive mutation hooks.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including player state, user profile, claim bonus, and QMY sync.",
  "frontend/src/hooks/useShareReward.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useVisualRewardSimulation.ts": "Hook that simulates a vesting-style reward schedule, calculating unlocked/locked QMY amounts and next unlock date based on the user's registration timestamp stored in localStorage.",
  "frontend/src/hooks/useWalkingMeters.ts": "Hook that tracks total walking distance in meters from GPS coordinates, filtering out jitter and unrealistic GPS jumps using speed and distance thresholds.",
  "frontend/src/i18n/config.ts": "Empty i18n configuration file with no implementation.",
  "frontend/src/i18n/locales/en.json": "English locale strings for the Quantumoney AR app, covering UI labels for navigation, camera, map, monsters, player stats, and common actions.",
  "frontend/src/i18n/locales/es.json": "Empty Spanish locale file with no translations defined.",
  "frontend/src/i18n/locales/pt.json": "Portuguese (Brazilian) localization file containing all UI string translations for the Quantumoney app, covering navigation, AR camera, map, monsters, wallet, and player stats.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports Inter and Orbitron fonts, defines a dark gold/black design system via CSS custom properties, and provides utility classes for glass cards, gold text, animations, and scrollbar styling.",
  "frontend/src/lib/arInteractionsStore.ts": "localStorage-backed cache for AR interaction states (locked coins and captured monsters), acting as a non-authoritative mirror of the canister's PlayerState with cross-tab sync support.",
  "frontend/src/lib/haversine.ts": "Utility library exporting functions to calculate geographic distances between two coordinates using the Haversine formula, returning results in meters or kilometers, and checking proximity within a radius.",
  "frontend/src/lib/mockGameplayState.ts": "localStorage-based gameplay state manager that tracks collected coins, captured monsters, and interacted spots per user identity, with optional canister-backed PlayerState as the authoritative source of truth.",
  "frontend/src/lib/mockSpawns.ts": "Defines the MockSpawn interface and a hardcoded list of AR spawn points (coins and monsters of various rarities) around Évora and Lisbon, Portugal, with a helper to filter spawns by proximity.",
  "frontend/src/lib/qmyApi.ts": "Mocked API client for QMY token balances and bonus history, using localStorage to persist a one-time registration bonus of 1000 QMY per principal, with XP management delegated to the canister.",
  "frontend/src/lib/qmyLocking.ts": "Manages QMY coin locking logic using localStorage, including locking coins for 30 days, resolving matured locks with rewards (+2 QMY per coin, -30 XP), and retrieving lock records per principal.",
  "frontend/src/lib/termsAcceptance.ts": "Centralized utility for tracking Terms acceptance state in localStorage under key 'qmy_terms_v1', with functions to accept, clear, check, and migrate from legacy acceptance keys.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/conceptualWallet.ts": "Generates a deterministic wallet ID from a principal using SHA-256 hashing and provides placeholder transaction data for visual display.",
  "frontend/src/utils/qaChecklistExport.ts": "Builds and exports QA checklist reports as JSON, supporting clipboard copy and file download with pass/fail/pending totals.",
  "frontend/src/utils/share.ts": "Provides a content sharing helper that tries the Web Share API first, then falls back to clipboard copy using modern and legacy methods.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings and hash-based routes, with sessionStorage persistence and cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (including gold variants), fonts, shadows, breakpoints, animations, and safe-area spacing, plus animate/typography/container-queries plugins.",
  "frontend/TECHNICAL_VERIFICATION_REPORT.md": "Technical analysis report verifying Quantumoney AR's data persistence architecture (three-tier ICP canister + local storage system) and store compatibility for Capacitor 6+ native packaging.",
  "project_state.json": "Project state document describing the AR-based PWA game (quantumoneyar.app) architecture, ICP canister integration, existing features, known issues, and image requirements at schema version 1.0.0.",
  "unknown.txt": "Documents the detailed architecture and MVP specification for a blockchain-based AR/GPS game on ICP, covering authentication flows, game mechanics, backend data storage, and DAO governance modules. Outlines core features including Internet Identity login, QMY token collection, anti-spoofing validation, and canister-based state management."
}