{
  "backend/main.mo": "Main ICP actor implementing user profile management (create, read, update display name/photo), bonus/vesting logic, and access-controlled endpoints using mixins for storage and authorization.",
  "feature_evidence.json": "Empty feature evidence report JSON with no recorded features.",
  "frontend-file-summaries.txt": "JSON mapping of frontend source file paths to short summaries describing each component's purpose and recent changes.",
  "frontend/ANDROID_BUILD_GUIDE.md": "Step-by-step guide for building and submitting the Quantumoney AR Android AAB to the Google Play Store, covering prerequisites, keystore generation, build configuration, and troubleshooting.",
  "frontend/android-build-config.json": "Android build configuration for Quantumoney AR specifying package name, SDK versions, keystore settings, required permissions, hardware features, and Google Play Store metadata.",
  "frontend/android-build.sh": "Bash script that checks prerequisites (Node.js, pnpm, Java, Android SDK), builds the web app, syncs with Capacitor, and generates either a release AAB or debug APK for the Quantumoney AR Android app.",
  "frontend/BUILD_INSTRUCTIONS.md": "Brief quick-start instructions for building the web application for mobile deployment.",
  "frontend/build-mobile.sh": "Bash script that builds the web app, initializes Capacitor platforms if needed, syncs assets, and builds Android (AAB/APK) and/or iOS packages based on platform and build-type arguments.",
  "frontend/build-native-interactive.sh": "Interactive bash menu script that checks prerequisites (Node.js, pnpm, Java, Xcode) and lets the user choose to build Android AAB/APK, iOS IPA/debug, both platforms, initialize Capacitor, or view build status.",
  "frontend/build-native-packages.sh": "One-command bash script with a numbered menu for building Android AAB, Android APK, iOS IPA, iOS debug, or both platforms; runs first-time Capacitor setup if platforms are not yet initialized.",
  "frontend/build-native.sh": "Bash script providing a simple menu to build Android AAB, iOS IPA, both platforms, or initialize a Capacitor project including installing dependencies and adding Android/iOS platforms.",
  "frontend/CAPACITOR_NATIVE_BUILD_GUIDE.md": "Comprehensive guide for generating native Android AAB and iOS IPA packages using Capacitor 6+, including prerequisites, step-by-step build instructions, and store submission details.",
  "frontend/CAPACITOR_SETUP.md": "Guide for initializing Capacitor 6+ in the Quantumoney AR project to convert the PWA into native Android and iOS applications.",
  "frontend/capacitor-init.sh": "Bash script that installs Capacitor 6+ dependencies, builds the web app, initializes the Capacitor project with package ID app.quantumoneyar.qmy, adds Android and iOS platforms, and syncs assets.",
  "frontend/capacitor-plugins.json": "Lists all required and optional Capacitor plugins (camera, geolocation, storage, etc.) with versions, descriptions, permissions, and installation commands for the Quantumoney AR mobile app.",
  "frontend/capacitor.config.json": "Capacitor configuration for the Quantumoney AR app defining app ID, web directory, server URL, plugin settings (SplashScreen, StatusBar, Camera, Geolocation), and Android/iOS platform options.",
  "frontend/CONTROLLER_CONSOLIDATION_PATCH.md": "Documents manual CLI commands and a verification checklist for adding a controller Principal to existing ICP canisters.",
  "frontend/DEPLOYMENT_STATUS.md": "Status report confirming Quantumoney AR is ready for native mobile packaging via Capacitor 6+, detailing architecture, configuration, and compatibility.",
  "frontend/DEPLOYMENT.md": "Mobile deployment guide covering PWA configuration, Android (TWA and Capacitor) deployment steps, and Google Play Store submission process.",
  "frontend/DEVICE_TESTING_REPORT.md": "Template for recording device testing results across Android and iOS, covering installation, authentication, camera/AR, GPS, wallet, DAO, and UI functionality.",
  "frontend/EXPORT_INSTRUCTIONS.md": "Quick export guide providing the fastest path to generate Android APK and iOS packages for Quantumoney AR.",
  "frontend/FINAL_BUILD_DELIVERY_REPORT.md": "Final delivery report summarizing all build infrastructure components, prerequisites, and execution instructions for generating Android AAB/APK and iOS IPA packages.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light and dark theme design tokens (colors, borders, charts, sidebar).",
  "frontend/index.html": "Main HTML entry point for the Quantumoney AR app, setting up meta tags for PWA/mobile support, Leaflet CSS, service worker registration, and mounting the React app root.",
  "frontend/install-test-devices.sh": "Interactive bash script providing a menu to install Android AAB/APK or iOS IPA builds onto real devices and run test suites using ADB and bundletool.",
  "frontend/install-test.sh": "Bash script with a menu to test Android AAB (via bundletool), debug APK, or iOS IPA installations on connected devices, including a manual testing checklist.",
  "frontend/IOS_BUILD_GUIDE.md": "Guide for building and submitting the Quantumoney AR iOS IPA to the Apple App Store using Capacitor 6+.",
  "frontend/ios-build-config.json": "iOS build configuration specifying bundle ID, version, deployment target, permissions, capabilities, App Store metadata, and screenshot requirements for Quantumoney AR.",
  "frontend/ios-build.sh": "Bash script for macOS that builds the React app, syncs Capacitor, installs CocoaPods, and either opens Xcode for a manual release archive or performs a debug build via xcodebuild.",
  "frontend/MOBILE_BUILD_DELIVERY_REPORT.md": "Delivery report confirming Quantumoney AR is ready for Google Play Store and Apple App Store submission, listing all build scripts, configuration files, and documentation as complete for Capacitor 6+ native packaging.",
  "frontend/MOBILE_BUILD_GUIDE.md": "Step-by-step guide for generating native Android APK and iOS packages for Quantumoney AR, covering prerequisites including Node.js, Android Studio, Xcode, and Capacitor CLI.",
  "frontend/MOBILE_EXPORT_DELIVERY.md": "Delivery report summarizing all configuration files and build scripts created for Capacitor 6+ native mobile packaging of Quantumoney AR, targeting Android AAB and iOS IPA outputs.",
  "frontend/NATIVE_BUILD_COMPLETE_GUIDE.md": "Comprehensive step-by-step guide covering the full pipeline from prerequisites through store submission for generating Android AAB and iOS IPA packages using Capacitor 6+.",
  "frontend/NATIVE_BUILD_COMPLETE.md": "Complete guide for generating Android AAB and iOS IPA packages for Quantumoney AR, detailing prerequisites, software requirements, and expected build output locations.",
  "frontend/NATIVE_BUILD_DELIVERY_FINAL.md": "Final delivery report confirming all infrastructure, configurations, build scripts, and documentation are ready for immediate native mobile build execution via Capacitor 6+.",
  "frontend/NATIVE_BUILD_DELIVERY_REPORT.md": "Delivery report confirming complete native mobile packaging infrastructure for Quantumoney AR, including Capacitor configuration, build systems, data persistence architecture, and store compliance verification.",
  "frontend/NATIVE_BUILD_EXECUTION_REPORT.md": "Detailed execution report documenting all infrastructure components including configuration files, build scripts, and their purposes for generating store-ready Android AAB and iOS IPA packages via Capacitor 6+.",
  "frontend/NATIVE_MOBILE_BUILD_INSTRUCTIONS.md": "Complete build instructions guide for generating Android AAB and iOS IPA from the Quantumoney AR PWA using Capacitor 6+, covering device testing, data persistence verification, and store submission.",
  "frontend/NATIVE_MOBILE_PACKAGING_GUIDE.md": "Packaging guide for Quantumoney AR describing the hybrid Capacitor 6+ architecture, prerequisites, and steps for generating Android AAB and iOS IPA with native camera, GPS, and offline support.",
  "frontend/NATIVE_PACKAGING_WORKFLOW.md": "Workflow guide detailing the full Android AAB and iOS IPA generation process, including software prerequisites, architecture confirmation, and a timeline estimate for Quantumoney AR.",
  "frontend/public/CNAME": "GitHub Pages CNAME file pointing the custom domain to quantumoney.github.io.",
  "frontend/public/data/qmy_spots.geojson": "GeoJSON FeatureCollection defining global QMY token spawn locations (e.g., Lisbon, Madrid, Tokyo) with coordinates, max token limits, and per-wallet claim rules.",
  "frontend/public/docs/index.json": "Index manifest for the Quantumoney AR documentation site, listing section titles, descriptions, and URLs for guides covering gameplay, tokenomics, DAO, and technical topics.",
  "frontend/public/manifest.json": "PWA web app manifest for Quantumoney AR, defining app metadata, icons, display settings, and shortcuts for the AR Camera and Profile sections.",
  "frontend/public/map/index.html": "HTML entry point for the standalone Leaflet-based world map page, loading Leaflet CSS/JS and the custom map.js/map.css files with a loading overlay.",
  "frontend/public/map/map.css": "Stylesheet for the Leaflet map page providing full-viewport layout, iOS safe-area support, a pulsing user-location marker animation, and gold-themed control styling.",
  "frontend/public/map/map.js": "Leaflet map script that renders coin and monster spawn markers synced with AR interaction state from localStorage, supporting real-time updates via postMessage.",
  "frontend/public/service-worker.js": "Service worker implementing a network-first caching strategy with precaching of essential assets, old cache cleanup on activation, and an offline fallback to index.html.",
  "frontend/QUICK_BUILD_INSTRUCTIONS.md": "Fast-track checklist and quick commands for building Android AAB and iOS IPA for Quantumoney AR, referencing the full guide for detailed steps.",
  "frontend/QUICK_BUILD_REFERENCE.md": "One-page quick reference listing prerequisites and quick-start commands for native Android and iOS builds of Quantumoney AR.",
  "frontend/QUICK_START_NATIVE.md": "Minimal quick-start guide providing one-command build instructions for generating Android AAB and iOS IPA for Quantumoney AR.",
  "frontend/README_MOBILE_EXPORT.md": "Overview README confirming the Quantumoney AR app is ready for mobile export, listing prerequisites and pointing to one-command build instructions for Android and iOS.",
  "frontend/src/App.tsx": "Root React component managing client-side routing between all app sections (HUD, AR, Map, Profile, etc.), legal terms acceptance modal, and context providers.",
  "frontend/src/components/3d/QMY3DCoin.tsx": "React Three Fiber component rendering an animated, spinning 3D gold coin with metallic material, floating motion, and configurable size.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar component with five icon-labeled tabs (Home, AR, Map, Profile, Rules) that highlights the active section in gold.",
  "frontend/src/components/compliance/VisualSimulationNotice.tsx": "Simple alert banner that notifies users the screen shows visual-only simulation data with no real crypto transactions, for app store compliance.",
  "frontend/src/components/Footer.tsx": "Renders a fixed footer with a brand credit and social sharing links (WhatsApp, X, Telegram, Instagram) using react-icons.",
  "frontend/src/components/gameplay/GameplayHUD.tsx": "Fixed overlay HUD card displaying real-time gameplay stats: XP, meters walked, nearby spawns count, and optional AR detection status.",
  "frontend/src/components/gameplay/TransparentRuleModal.tsx": "Reusable dialog modal supporting 'rules' and 'congratulations' variants with scrollable content, confirm/cancel actions, and an optional share button.",
  "frontend/src/components/gameplay/UniverseBackdrop.tsx": "Renders a fixed, semi-transparent animated GIF background image as a non-interactive universe backdrop behind gameplay UI.",
  "frontend/src/components/GoldenPaperIcon.tsx": "Empty file with no content.",
  "frontend/src/components/GoldenPaperOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with a hamburger menu, logo, refresh button, and an authenticated user dropdown showing profile name/avatar with logout and profile navigation options.",
  "frontend/src/components/legal/BackToTopButton.tsx": "Fixed button that appears after scrolling 300px and smoothly scrolls the page back to the top when clicked.",
  "frontend/src/components/legal/LegalTableOfContents.tsx": "Table of contents component with IntersectionObserver-based active section highlighting, a sticky desktop sidebar, and a collapsible mobile dropdown.",
  "frontend/src/components/LegalModal.tsx": "A blocking dialog that requires users to grant camera and location permissions and accept terms, privacy policy, cookies, and age confirmation before proceeding.",
  "frontend/src/components/monsters/monsterCatalog.ts": "Empty file with no content.",
  "frontend/src/components/monsters/MonsterCollection.tsx": "Empty file with no content.",
  "frontend/src/components/profile/ConceptualAllocationsPlaceholders.tsx": "Displays four placeholder token allocation cards (Pre-Sale, Team, Founders, Advisors) with amounts and percentages, clearly labeled as conceptual/visual simulation only.",
  "frontend/src/components/profile/GameplayHistoryMiniMap.tsx": "Canvas-based mini-map that plots gameplay history events with lat/lng coordinates as color-coded markers (by event type) with a grid overlay and legend.",
  "frontend/src/components/profile/RecentActivityBanner.tsx": "Displays a transient banner card showing the most recent player activity (collect, capture, or level-up) with an appropriate icon, visible only for 10 seconds after the event.",
  "frontend/src/components/sections/ARCamera.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ARScreen.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ARView.tsx": "Empty file with no content.",
  "frontend/src/components/sections/BCQPanel.tsx": "Empty file with no content.",
  "frontend/src/components/sections/BetaQAChecklist.tsx": "Renders an interactive QA checklist for beta testing that auto-detects status of terms acceptance, login flow, and UI checks, with manual override support and export/copy/download functionality.",
  "frontend/src/components/sections/Bridge.tsx": "Empty file with no content.",
  "frontend/src/components/sections/Burn.tsx": "Displays QMY token burn statistics including supply metrics, burn history table, and charts, with an admin burn input form; requires Internet Identity login to view.",
  "frontend/src/components/sections/CameraAR/arMath.ts": "Provides AR math utilities including bearing calculation between GPS coordinates, angle normalization, and projection of a world bearing to a screen X/Y percentage given the user's heading and field of view.",
  "frontend/src/components/sections/CameraAR/CameraARActionBar.tsx": "Renders action buttons for interacting with the nearest AR spawn (lock/unlock a coin or capture a monster), triggering mutations, XP events, and visual effects on action.",
  "frontend/src/components/sections/CameraAR/CameraARControls.tsx": "Provides start/stop camera toggle buttons rendered at the bottom of the AR camera view.",
  "frontend/src/components/sections/CameraAR/CameraARPage.tsx": "Main AR camera page that composes the camera feed, AR overlay, HUD, and action bar, computing visible spawns and the nearest interactable spawn based on geolocation and device heading.",
  "frontend/src/components/sections/CameraAR/OverlayLayer.tsx": "Renders AR spawn sprites (coins and monsters) as absolutely positioned overlays on the camera feed, projecting each spawn's bearing to a screen position and showing distance and status labels.",
  "frontend/src/components/sections/CameraAR/sprites.ts": "Defines a sprite asset map linking object types (coins, monsters) to static image paths, with a helper function to retrieve the correct sprite URL.",
  "frontend/src/components/sections/CameraAR/tolerance.ts": "Exports a function that returns the AR angular tolerance in degrees based on the player's XP level.",
  "frontend/src/components/sections/CameraAR/useArVisibility.ts": "Custom React hook that filters spawn items to only those within 200 meters and within the player's heading tolerance, returning the visible AR spawns.",
  "frontend/src/components/sections/CameraAR/useDeviceHeading.ts": "Custom React hook that reads device compass heading via the DeviceOrientation API, handling iOS permission requests and throttling updates to 100ms intervals.",
  "frontend/src/components/sections/ChatRoom.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ComingSoon.tsx": "Displays a 'coming soon' placeholder card for unfinished sections (map or AR) with a button to navigate back to the home HUD.",
  "frontend/src/components/sections/CoverPage.tsx": "Renders the game's cover/landing page with an animated universe background, a 3D spinning gold coin via React Three Fiber, and an 'Enter Game' button.",
  "frontend/src/components/sections/DAOStructure.tsx": "Displays a DAO governance UI with tabs for viewing/voting on mock proposals and a live chat room with message input.",
  "frontend/src/components/sections/EconomicModel.tsx": "Static informational page describing the Quantum Yield economic model, showing APY stats, staking pools, and participant benefit breakdowns.",
  "frontend/src/components/sections/GameArchitecture.tsx": "Static informational page presenting the game's technical architecture across tabbed views covering system overview, components, data flow, diagrams, and MVP scope.",
  "frontend/src/components/sections/GlobalDistribution.tsx": "Displays a tabbed UI showing QMY token geographic distribution, pre-sale phases, distribution pools, and vesting schedules using progress bars, badges, and cards. All data is visual/simulation only, aligned with the Gold Paper's 600M QMY allocation.",
  "frontend/src/components/sections/GlobalStatus.tsx": "Shows global game statistics including registered players, planted/burned QMY, daily XP charts, QMY distribution pie chart, and a top-10 player leaderboard using mock data and Recharts visualizations.",
  "frontend/src/components/sections/GoldPaper.tsx": "Empty file with no content.",
  "frontend/src/components/sections/GoogleMaps.tsx": "Empty file with no content.",
  "frontend/src/components/sections/HomeSpaceBackground.tsx": "Renders an animated canvas-based space background with twinkling stars, wobbling planets with rings and glows, and periodic comets using requestAnimationFrame.",
  "frontend/src/components/sections/HUD.tsx": "Main game hub component that displays a 3D spinning coin, user QMY balance, navigation buttons to key app sections, and triggers welcome bonus or welcome-back modals based on the user's registration state.",
  "frontend/src/components/sections/Introduction.tsx": "Static informational section presenting the Quantumoney (QMY) project's mission, vision, core values (security, transparency, innovation), and competitive differentials using cards and icons.",
  "frontend/src/components/sections/Inventory.tsx": "Displays a tabbed inventory UI showing mock creatures, items, and achievements for authenticated users. Redirects unauthenticated users to a login-required card.",
  "frontend/src/components/sections/LeafletMap.tsx": "Renders a Leaflet OpenStreetMap via an iframe for authenticated users, with a loading spinner and an info overlay card. Unauthenticated users see an authentication-required message.",
  "frontend/src/components/sections/LeafletMapPage.tsx": "Full-featured map page that integrates geolocation, simulated location, nearby spawns, and a GameplayHUD overlay on top of a Leaflet iframe. Sends player location updates to the iframe via postMessage.",
  "frontend/src/components/sections/LeafletWorldMap.tsx": "Empty file with no content.",
  "frontend/src/components/sections/legal/HowItWorks.tsx": "Renders the 'How It Works' legal page by mapping over sections from legalContent, displaying titles and content in a scrollable black-themed layout.",
  "frontend/src/components/sections/legal/Mission.tsx": "Renders the Mission legal page using missionContent data, displaying sectioned text in a scrollable dark layout identical in structure to HowItWorks.",
  "frontend/src/components/sections/legal/PrivacyPolicy.tsx": "Renders the Privacy Policy page with a sidebar table of contents, anchored sections from privacyContent, and a back-to-top button in a gold-accented dark layout.",
  "frontend/src/components/sections/legal/Terms.tsx": "Renders the Terms of Service page with a sidebar table of contents, anchored sections from termsContent, and a back-to-top button, mirroring the PrivacyPolicy layout.",
  "frontend/src/components/sections/MapLibreWorld.tsx": "Authentication-gated wrapper that renders the StaticWorldMap component for logged-in users, or an alert card for unauthenticated users.",
  "frontend/src/components/sections/MapMundo.tsx": "Empty file with no content.",
  "frontend/src/components/sections/MapMundoLeaflet.tsx": "Renders a Leaflet map iframe and syncs AR interaction state (locked coins, captured monsters, spawns) to it via postMessage on load and on localStorage changes.",
  "frontend/src/components/sections/MapView.tsx": "Empty file with no content.",
  "frontend/src/components/sections/MarketAnalysis.tsx": "Displays a market analysis page with competitor comparison data, market growth bar charts, and key metric cards using Recharts and shadcn UI components.",
  "frontend/src/components/sections/MundoMap.tsx": "Empty file with no content.",
  "frontend/src/components/sections/Partnerships.tsx": "Renders a partnerships page listing mock partner cards with categories and descriptions, along with a strategy overview section using icons and grid layout.",
  "frontend/src/components/sections/Profile.tsx": "Displays the user's profile page with editable display name and profile photo, showing XP/level/rank stats, QMY wallet balances, vesting schedule, and canister IDs. Uses React Query mutations to update name and photo via the backend actor.",
  "frontend/src/components/sections/Roadmap.tsx": "Renders a project roadmap timeline from Q4 2025 through 2027+, displaying each phase as a card with status icons (completed, current, upcoming) and a list of milestone items.",
  "frontend/src/components/sections/RulesTutorial.tsx": "Provides a tabbed how-to-play guide covering game basics, QMY coin mechanics, and AR camera usage, with icon-labeled cards explaining each concept.",
  "frontend/src/components/sections/StaticWorldMap.tsx": "Renders a static world map image overlaid with player and spawn markers (coins/monsters), supporting layer toggles, location presets, and nearby spawn counts derived from simulated location context.",
  "frontend/src/components/sections/SWAP.tsx": "Empty file with no content or exports.",
  "frontend/src/components/sections/TableOfContents.tsx": "Displays a navigable grid of cards linking to the main app sections (AR Camera, World Map, Profile, Rules & Tutorial) using a passed-in navigation callback.",
  "frontend/src/components/sections/TechnicalAppendix.tsx": "Shows a technical appendix with tabbed sections for mathematical formulas (staking rewards, burn rate, voting power, dynamic APY), specifications, and security details relevant to the QMY token protocol.",
  "frontend/src/components/sections/Technology.tsx": "Displays the Technology section of the Quantumoney app, covering ICP blockchain specs, smart contracts, interoperability, and scalability using tabbed cards with amber-themed styling.",
  "frontend/src/components/sections/Tokenomics.tsx": "Renders the Tokenomics section with pie chart token distribution, line chart release schedule, and burn mechanism details using Recharts and a tabbed layout.",
  "frontend/src/components/sections/Vesting.tsx": "Dedicated vesting page showing 700M QMY token unlock schedule, progress charts, canister IDs, and a table of 12 monthly unlock events with copy-to-clipboard functionality.",
  "frontend/src/components/sections/Wallet.tsx": "Empty file with no content or exports.",
  "frontend/src/components/SideDrawer.tsx": "A slide-in left drawer providing navigation links for gameplay sections (Home, AR, Map, Profile, etc.) and informational pages, with a logout button for authenticated users.",
  "frontend/src/components/TermsModal.tsx": "A blocking modal displaying scrollable terms of service content that enables the Accept button only after the user scrolls to the end, storing acceptance in local storage.",
  "frontend/src/components/VestingBanner.tsx": "Empty file with no content.",
  "frontend/src/components/wallet/QmySendReceive.tsx": "UI-only Send & Receive QMY component that lets users input a Login ID and amount to simulate token transfers, with toast notifications and a copyable personal Login ID display.",
  "frontend/src/components/WalletHUD.tsx": "Empty file with no content.",
  "frontend/src/components/WelcomeBackModal.tsx": "A modal shown to returning users displaying their unlocked/locked QMY balances, total QMY, and a vesting progress bar fetched via the claim bonus query.",
  "frontend/src/components/WelcomeBanner.tsx": "Empty file with no content.",
  "frontend/src/components/WelcomeBonusModal.tsx": "Modal component that displays a welcome bonus breakdown (100 XP, 100 unlocked QMY, 900 locked QMY) with a 9-month vesting schedule grid, and invalidates relevant React Query caches on close.",
  "frontend/src/content/legalContent.ts": "Defines TypeScript interfaces and static content for the app's Terms of Service and Privacy Policy, including sections on eligibility, acceptable use, data collection, and location/camera data handling.",
  "frontend/src/contexts/GameStateContext.tsx": "React context provider that centralizes game state (XP, QMY balances, captured monsters, locked coins, vesting schedule) by fetching data via React Query and exposing mutations like claiming the welcome bonus.",
  "frontend/src/contexts/GeolocationContext.tsx": "React context provider that manages real GPS geolocation, handling permission states, position tracking via the browser Geolocation API, and user-friendly error messages.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for i18n supporting English and Portuguese, exposing a translation function and language switcher backed by a static key-value translations record.",
  "frontend/src/contexts/ProximitySettingsContext.tsx": "React context provider that persists and exposes a configurable proximity radius (10 or 20 meters) to localStorage for use across the app.",
  "frontend/src/contexts/SimulatedLocationContext.tsx": "React context provider that supplies a fake GPS location with preset cities, directional movement, and sessionStorage persistence, used for testing AR gameplay without real GPS.",
  "frontend/src/gameplay/audio/useSfx.ts": "Custom React hook that provides sound effect playback for game events (collect, spawn, levelup, capture) using the Web Audio API with mute support and silent failure handling.",
  "frontend/src/gameplay/bonus/registrationBonus.ts": "Calculates a registration bonus schedule that unlocks 1000 tokens over 9 months (100 initially, 100/month), returning unlock dates, progress, and locked/unlocked amounts based on registration timestamp.",
  "frontend/src/gameplay/density/buildDensityZones.ts": "Groups geographic spots into 0.5-degree grid buckets and returns density zones with normalized density values and color-coded RGBA fills (green/yellow/red).",
  "frontend/src/gameplay/fx/SpawnCollectFX.tsx": "Renders a temporary fullscreen animated overlay for coin-lock, monster-capture, or level-up events, auto-dismissing after 1.5 seconds with a fade-in/out animation.",
  "frontend/src/gameplay/history/types.ts": "Defines TypeScript interfaces for gameplay history events (coin-collect, creature-capture, level-up, bonus-unlock) and computed player stats.",
  "frontend/src/gameplay/history/useGameplayHistory.ts": "React hook that persists up to 100 gameplay history events per user in localStorage, keyed by principal, with add and clear operations.",
  "frontend/src/gameplay/progression/leveling.ts": "Provides XP-based leveling utilities including level calculation (100 XP/level), level-up detection, progress percentage, and rank label derivation.",
  "frontend/src/gameplay/spots/spotTaxonomy.ts": "Defines the unified taxonomy of spot types (coin-unlocked, coin-locked, creature variants) with labels, colors, icon paths, XP rewards, and accessor functions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useArActions.ts": "Provides React Query mutations for AR interactions (lockCoin, unlockCoin, captureMonster) that call the backend actor, update the local interactions store, and show toast notifications.",
  "frontend/src/hooks/useArInteractions.ts": "Thin hook that exposes isCoinLocked and isMonsterCaptured helpers from the GameStateContext.",
  "frontend/src/hooks/useBetaQaChecklistOverrides.ts": "Hook for persisting beta QA checklist status overrides (pass/fail/pending with notes) in localStorage with versioned storage and CRUD operations.",
  "frontend/src/hooks/useGeolocation.ts": "Re-exports the geolocation hook from GeolocationContext as a named hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY AuthClient, providing a React context and hook with login/logout, identity persistence, and login status tracking.",
  "frontend/src/hooks/usePlayerState.ts": "React Query hook that fetches player state from the backend actor and syncs locked coins and captured monsters into the local arInteractionsStore, polling every 30 seconds.",
  "frontend/src/hooks/usePlugWallet.ts": "Empty file with no content.",
  "frontend/src/hooks/usePrototypeDetection.ts": "A React hook that performs client-side motion and brightness variance detection on a video stream using a hidden canvas, returning a confidence score and detected boolean updated ~3 times per second.",
  "frontend/src/hooks/useQmySync.ts": "Provides React Query hooks for reading QMY sync data (player state and bonus) from the canister, plus UI-only mutation hooks for simulated QMY send and receive operations.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks wrapping canister actor calls for user profile, player state, claim bonus, vesting schedule, and QMY sync data.",
  "frontend/src/hooks/useShareReward.ts": "Empty file with no content.",
  "frontend/src/hooks/useSpawnList.ts": "Fetches the list of spawn items from the canister actor, falling back to mock spawn data if the actor is unavailable or returns an empty result.",
  "frontend/src/hooks/useVisualRewardSimulation.ts": "Simulates a vesting reward schedule for a logged-in user by calculating unlocked/locked QMY amounts and next unlock date based on a registration timestamp stored in localStorage.",
  "frontend/src/hooks/useWalkingMeters.ts": "Tracks total meters walked from GPS coordinates, filtering out jitter below 1 meter and GPS jumps above 10 m/s, with throttled updates every 2 seconds.",
  "frontend/src/i18n/config.ts": "Empty file with no content.",
  "frontend/src/i18n/locales/en.json": "English locale strings for the Quantumoney AR app, covering UI labels, game actions, wallet, camera, location, ranks, and general navigation.",
  "frontend/src/i18n/locales/es.json": "Empty file with no content.",
  "frontend/src/i18n/locales/pt.json": "Portuguese (PT) locale file containing all UI string translations for the Quantumoney AR app, covering authentication, wallet, AR camera, gameplay, and navigation labels.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports Orbitron/Inter fonts, defines an OKLCH-based gold/dark design token system, and provides utility classes for glass cards, gold colors, borders, and safe-area spacing.",
  "frontend/src/lib/arInteractionsStore.ts": "localStorage-backed cache for AR coin lock and monster capture states, providing read/write helpers and a sync method to update from the authoritative canister PlayerState.",
  "frontend/src/lib/haversine.ts": "Utility library implementing the Haversine formula to calculate distances between geographic coordinates in meters or kilometers, and to check if a point falls within a given radius.",
  "frontend/src/lib/mockGameplayState.ts": "Client-side localStorage fallback cache for player gameplay state (XP, collected coins, captured monsters, locked coins), used only when the canister is unreachable and synced from canister PlayerState when available.",
  "frontend/src/lib/mockSpawns.ts": "Fallback static dataset of AR spawn items (coins and monsters) near Évora, Portugal, with helper functions to filter spawns by proximity using the Haversine distance calculation.",
  "frontend/src/lib/qmyApi.ts": "Visual-only fallback API module that caches QMY balance, locked balance, XP, and transaction history in localStorage; all real data comes from the canister and send/receive functions are non-functional stubs.",
  "frontend/src/lib/qmyLocking.ts": "Legacy local-cache-only module for tracking QMY coin locks with 30-day durations in localStorage; kept for backward compatibility but does not interact with the canister.",
  "frontend/src/lib/termsAcceptance.ts": "Utility module managing Terms & Conditions acceptance state in localStorage under the key 'qmy_terms_v1', including helpers to accept, check, clear, and migrate from legacy acceptance keys.",
  "frontend/src/main.tsx": "React application entry point that mounts the app with React Query and InternetIdentity providers wrapping the root App component.",
  "frontend/src/utils/conceptualWallet.ts": "Generates a deterministic wallet ID from an ICP Principal using SHA-256 hashing and provides placeholder transaction data for visual display.",
  "frontend/src/utils/qaChecklistExport.ts": "Builds QA checklist export reports with pass/fail/pending totals and provides utilities to copy the report to clipboard or download it as a JSON file.",
  "frontend/src/utils/share.ts": "Shares content using the Web Share API with clipboard fallback, returning the method used and whether it succeeded.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from query strings and hash-based routes, with sessionStorage persistence and hash cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based design tokens, gold color variants, custom fonts, animations, and safe-area spacing for the QuantumoneyAR frontend.",
  "frontend/TECHNICAL_VERIFICATION_REPORT.md": "Technical analysis verifying Quantumoney AR's three-tier data persistence architecture (ICP canisters, localStorage, Capacitor Storage) and store compatibility for native mobile packaging.",
  "project_state.json": "Tracks the QuantumoneyAR project state including canister IDs, known issues around divergent identities between quantumoney.app and quantumoneyar.app, and pending feature requests to unify authentication and backend connections.",
  "unknown.txt": "Portuguese-language documentation describing game flows, MVP features, backend data structures, and core operations for the QuantumoneyAR blockchain-based AR game."
}