{
  "backend/main.mo": "Main Motoko actor for the Quantumoney backend, handling user profiles (create/read/update), blob storage, access control, and bonus/vesting logic via mixins and helper functions.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to their associated frontend files, components, test IDs, and confidence levels for the Quantumoney AR build.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key details of every component, hook, and page in the frontend.",
  "frontend/ANDROID_BUILD_GUIDE.md": "Step-by-step guide for building and submitting the Quantumoney AR app to the Google Play Store, covering prerequisites, keystore generation, AAB build, and store submission.",
  "frontend/android-build-config.json": "Android build configuration for Quantumoney AR specifying package name, SDK versions, signing keystore placeholders, required permissions/features, and Google Play Store metadata.",
  "frontend/android-build.sh": "Bash script that checks prerequisites, builds the web app, syncs with Capacitor, and produces either a release AAB or debug APK for the Android platform.",
  "frontend/BUILD_INSTRUCTIONS.md": "Brief quick-start instructions for building the web application for mobile deployment.",
  "frontend/build-mobile.sh": "Bash script that builds the web app, initializes Capacitor platforms, syncs assets, and builds Android (AAB/APK) and/or iOS packages based on platform and build-type arguments.",
  "frontend/build-native-interactive.sh": "Interactive bash menu script that checks prerequisites (Node, pnpm, Java, Xcode) and lets the user choose between Android AAB, Android APK, iOS IPA, iOS debug, both-platform, or initialization builds.",
  "frontend/build-native-packages.sh": "One-command bash script with a numbered menu for generating Android AAB, Android APK, iOS IPA, iOS debug, or combined release/debug packages, running first-time Capacitor setup if needed.",
  "frontend/build-native.sh": "Bash script presenting a simple menu to build Android AAB, iOS IPA, both platforms, or initialize the Capacitor project with required dependencies and platform targets.",
  "frontend/CAPACITOR_NATIVE_BUILD_GUIDE.md": "Comprehensive guide for generating native Android AAB and iOS IPA packages using Capacitor 6+, including prerequisites, build steps, testing, and store submission.",
  "frontend/CAPACITOR_SETUP.md": "Setup guide for initializing Capacitor 6+ in the Quantumoney AR project to convert the PWA into native Android and iOS applications.",
  "frontend/capacitor-init.sh": "Bash script that initializes Capacitor 6+ for the Quantumoney AR project by installing dependencies, building the web app, and adding Android/iOS native platforms.",
  "frontend/capacitor-plugins.json": "JSON manifest listing all required and optional Capacitor 6 plugins for the app, including their versions, descriptions, and required native permissions.",
  "frontend/capacitor.config.json": "Capacitor configuration file defining the app ID, web directory, server settings, plugin options (SplashScreen, StatusBar, Geolocation, etc.), and Android/iOS platform-specific settings.",
  "frontend/CONTROLLER_CONSOLIDATION_PATCH.md": "Documents manual CLI commands and a verification checklist for adding a controller Principal to existing ICP canisters.",
  "frontend/DEPLOYMENT_STATUS.md": "Status report confirming the Quantumoney AR app is ready for native packaging via Capacitor 6+, detailing architecture, build outputs, and compatibility.",
  "frontend/DEPLOYMENT.md": "Mobile deployment guide covering PWA configuration, Android (TWA and Capacitor) deployment steps, and Google Play Store submission process.",
  "frontend/DEVICE_TESTING_REPORT.md": "Template for recording device testing results across Android and iOS, covering installation, authentication, camera/AR, GPS, wallet, DAO, and UI functionality.",
  "frontend/EXPORT_INSTRUCTIONS.md": "Quick export guide providing the fastest path to generate downloadable Android APK and iOS packages for Quantumoney AR.",
  "frontend/FINAL_BUILD_DELIVERY_REPORT.md": "Final delivery report for Quantumoney AR native mobile builds (Android AAB/APK and iOS IPA), listing all build infrastructure components, prerequisites, and execution instructions while noting AI cannot directly run builds.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light and dark theme design tokens including colors, borders, and sidebar variables.",
  "frontend/index.html": "Main HTML entry point for the Quantumoney AR app, including PWA meta tags, manifest/icon links, Leaflet CSS, the React root div, and service worker registration with install prompt logic.",
  "frontend/install-test-devices.sh": "Interactive bash script providing a menu to install Android AAB/APK or iOS IPA builds onto real connected devices and run test suites including data persistence verification.",
  "frontend/install-test.sh": "Bash script with a simple menu for testing Android AAB (via bundletool), debug APK, or iOS IPA installations on connected devices, including a manual testing checklist.",
  "frontend/IOS_BUILD_GUIDE.md": "Concise iOS build guide for submitting Quantumoney AR to the Apple App Store, providing a one-command build entry point for version 200.",
  "frontend/ios-build-config.json": "iOS build configuration JSON specifying bundle identifier, version, deployment target, required permissions, App Store metadata, and screenshot size requirements for the Quantumoney AR app.",
  "frontend/ios-build.sh": "Bash script for building the Quantumoney AR iOS IPA on macOS, checking prerequisites (Node.js, pnpm, Xcode, CocoaPods), building the web app, syncing Capacitor, and guiding release or debug archive creation.",
  "frontend/MOBILE_BUILD_DELIVERY_REPORT.md": "Delivery report confirming all Capacitor 6+ build scripts, configuration files, and documentation are ready for generating Google Play Store AAB and App Store IPA packages for Quantumoney AR.",
  "frontend/MOBILE_BUILD_GUIDE.md": "Step-by-step guide for generating native Android APK and iOS packages for Quantumoney AR using Capacitor CLI, covering required software prerequisites and project setup.",
  "frontend/MOBILE_EXPORT_DELIVERY.md": "Export delivery report detailing all configuration files and build scripts created for Capacitor 6+ native mobile packaging of Quantumoney AR, targeting Android AAB and iOS IPA outputs.",
  "frontend/NATIVE_BUILD_COMPLETE_GUIDE.md": "Comprehensive step-by-step guide covering the full pipeline from prerequisites through store submission for generating Android AAB and iOS IPA packages via Capacitor 6+.",
  "frontend/NATIVE_BUILD_COMPLETE.md": "Complete guide for generating Android AAB and iOS IPA packages for Quantumoney AR (Build 200), listing required software prerequisites and expected build output paths.",
  "frontend/NATIVE_BUILD_DELIVERY_FINAL.md": "Final delivery report confirming complete readiness of Quantumoney AR's Capacitor 6+ infrastructure for immediate Android AAB and iOS IPA build execution.",
  "frontend/NATIVE_BUILD_DELIVERY_REPORT.md": "Delivery report confirming production-ready native mobile packaging infrastructure for Quantumoney AR, covering Capacitor configuration, build systems, data persistence, and store compliance.",
  "frontend/NATIVE_BUILD_EXECUTION_REPORT.md": "Detailed execution report documenting all infrastructure components for Quantumoney AR's Capacitor 6+ build system, including configuration files, build scripts, and their purposes and outputs.",
  "frontend/NATIVE_MOBILE_BUILD_INSTRUCTIONS.md": "Complete instructions guide for generating Android AAB and iOS IPA from the Quantumoney AR PWA using Capacitor 6+, covering build steps, device testing, and store submission.",
  "frontend/NATIVE_MOBILE_PACKAGING_GUIDE.md": "Packaging guide for wrapping the Quantumoney AR web app in a Capacitor 6+ native WebView container, detailing prerequisites, architecture, and build steps for both Android and iOS.",
  "frontend/NATIVE_PACKAGING_WORKFLOW.md": "End-to-end workflow guide for generating Android AAB and iOS IPA packages from Quantumoney AR, including architecture details, prerequisite tables, and a timeline estimate.",
  "frontend/public/CNAME": "GitHub Pages custom domain file pointing to quantumoney.github.io.",
  "frontend/public/data/qmy_spots.geojson": "GeoJSON FeatureCollection defining global QMY token spawn locations (e.g., Lisbon, Madrid, Tokyo) with per-spot max token limits and per-wallet cooldown rules.",
  "frontend/public/docs/index.json": "Documentation index JSON listing the six documentation sections (getting started, gameplay, tokenomics, DAO, technical, mobile) with their URLs and external links for the Quantumoney AR project.",
  "frontend/public/manifest.json": "PWA manifest for Quantumoney AR defining app metadata, icons, display mode, theme colors, and shortcuts for the AR Camera and Profile sections.",
  "frontend/public/map/index.html": "HTML entry point for the Quantumoney AR world map page, loading Leaflet.js/CSS and a custom map script to visualize spawn points.",
  "frontend/public/map/map.css": "CSS stylesheet for the full-viewport Leaflet map, including safe-area insets for iOS, a pulsing user location marker, gold-accented zoom controls, and a loading overlay.",
  "frontend/public/map/map.js": "Leaflet map script that renders coin and monster spawn markers, syncs their locked/captured state from localStorage and postMessage, and displays interactive popups for each spawn.",
  "frontend/public/service-worker.js": "Service worker implementing a network-first caching strategy with precaching of essential assets, old cache cleanup on activation, and an offline fallback to index.html for navigation requests.",
  "frontend/QUICK_BUILD_INSTRUCTIONS.md": "Fast-track checklist and quick-reference commands for building Quantumoney AR native packages, pointing to the full guide for detailed instructions.",
  "frontend/QUICK_BUILD_REFERENCE.md": "One-page quick reference card listing prerequisites and first-time setup commands for Android and iOS native builds of Quantumoney AR.",
  "frontend/QUICK_START_NATIVE.md": "Minimal quick-start guide providing one-command build instructions for generating Android AAB and iOS IPA packages for Quantumoney AR.",
  "frontend/README_MOBILE_EXPORT.md": "Overview README confirming the Quantumoney AR app is ready for mobile export, listing PWA prerequisites already in place and providing a one-command build entry point.",
  "frontend/src/App.tsx": "Root application component that manages routing between sections via URL paths, wraps the app in multiple context providers, and conditionally renders a legal acceptance modal before showing the main UI.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with five icon-based nav items (Home, AR, Map, Profile, Rules) that highlights the active section and calls onNavigate on click.",
  "frontend/src/components/compliance/VisualSimulationNotice.tsx": "Alert banner that informs users the screen shows visual-only placeholder data with no real crypto transactions, citing app store compliance.",
  "frontend/src/components/Footer.tsx": "Minimal footer component displaying social share links for WhatsApp, X, Telegram, and Instagram along with a brand attribution line.",
  "frontend/src/components/gameplay/GameplayHUD.tsx": "Fixed overlay HUD card displaying real-time gameplay stats: XP, meters walked, nearby spawns count, and optional AR detection status.",
  "frontend/src/components/gameplay/TransparentRuleModal.tsx": "Reusable dialog modal with scrollable content supporting two variants ('rules' and 'congratulations'), optional share button, and configurable confirm/cancel actions.",
  "frontend/src/components/gameplay/UniverseBackdrop.tsx": "Fixed full-screen background component that renders a dimmed animated universe GIF as a non-interactive visual backdrop.",
  "frontend/src/components/GoldenPaperIcon.tsx": "Empty file with no content.",
  "frontend/src/components/GoldenPaperOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Fixed top header with a hamburger menu, logo, refresh button, and an authenticated user dropdown that supports profile navigation and logout via Internet Identity.",
  "frontend/src/components/LegalModal.tsx": "Modal dialog that requires users to grant camera and location permissions and check off terms, privacy, cookies, and age confirmation checkboxes before proceeding into the app.",
  "frontend/src/components/monsters/monsterCatalog.ts": "Empty file with no content.",
  "frontend/src/components/monsters/MonsterCollection.tsx": "Empty file with no content.",
  "frontend/src/components/profile/ConceptualAllocationsPlaceholders.tsx": "Displays four placeholder token allocation cards (Pre-Sale, Team, Founders, Advisors) with amounts and percentages, clearly labeled as conceptual/visual simulation with tooltip disclaimers.",
  "frontend/src/components/profile/GameplayHistoryMiniMap.tsx": "Canvas-based mini-map that plots gameplay history events with geographic coordinates, color-coded by event type (coin-lock, monster-capture, xp-gain, level-up), with a fallback empty state card.",
  "frontend/src/components/profile/RecentActivityBanner.tsx": "Transient activity banner that shows the most recent gameplay event (collect, capture, or level-up) with an icon and message, auto-hiding after 10 seconds.",
  "frontend/src/components/sections/ARCamera.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ARScreen.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ARView.tsx": "Empty file with no content.",
  "frontend/src/components/sections/BCQPanel.tsx": "Empty file with no content.",
  "frontend/src/components/sections/BetaQAChecklist.tsx": "A QA checklist component for beta testing that auto-detects status of Terms flow, UI, and technical checks using localStorage and DOM inspection, with manual override support and export/copy/download functionality.",
  "frontend/src/components/sections/Bridge.tsx": "An empty file with no content or exports.",
  "frontend/src/components/sections/Burn.tsx": "Displays QMY token burn statistics including burn history, supply metrics, and charts, with an admin burn form; requires Internet Identity login to view.",
  "frontend/src/components/sections/CameraAR/arMath.ts": "Provides AR math utilities including bearing calculation between GPS coordinates, angle normalization, and projection of world bearings to screen percentage positions within a configurable FOV.",
  "frontend/src/components/sections/CameraAR/CameraARActionBar.tsx": "Renders action buttons (Lock/Unlock coin, Capture monster) for the nearest AR spawn within range, triggering mutations and gameplay history events with visual FX feedback.",
  "frontend/src/components/sections/CameraAR/CameraARControls.tsx": "A simple UI component rendering Start/Stop camera buttons for the AR camera view.",
  "frontend/src/components/sections/CameraAR/CameraARPage.tsx": "The main AR camera page that composites the live camera feed, AR spawn overlay, gameplay HUD, and action bar, computing the nearest interactable spawn within 50 meters.",
  "frontend/src/components/sections/CameraAR/OverlayLayer.tsx": "Renders AR spawn sprites (coins and monsters) projected onto the camera view using bearing and heading calculations, with distance labels and locked/captured state indicators.",
  "frontend/src/components/sections/CameraAR/sprites.ts": "Maps spawn type strings to static image asset paths for AR overlay sprite rendering, with a fallback to the unlocked coin sprite.",
  "frontend/src/components/sections/CameraAR/tolerance.ts": "Returns an angular tolerance value (in degrees) for AR targeting based on the player's XP level.",
  "frontend/src/components/sections/CameraAR/useArVisibility.ts": "Custom React hook that filters spawn items to only those within 200 meters and within the player's angular field of view based on GPS position, compass heading, and XP-based tolerance.",
  "frontend/src/components/sections/CameraAR/useDeviceHeading.ts": "Custom React hook that reads device compass heading from the DeviceOrientation API, handling iOS permission requests and webkit-specific compass values, throttled to 100ms updates.",
  "frontend/src/components/sections/ChatRoom.tsx": "Empty file with no content.",
  "frontend/src/components/sections/ComingSoon.tsx": "Placeholder component displayed for unimplemented sections (map, AR) showing a 'Coming Soon' card with a button to navigate back to the HUD.",
  "frontend/src/components/sections/CoverPage.tsx": "Landing/splash page component displaying the Quantumoney game branding, animated coin, and an 'Enter Game' button that navigates to the HUD section.",
  "frontend/src/components/sections/DAOStructure.tsx": "DAO governance UI component with tabs for viewing/voting on mock proposals and a live chat room with message input, displaying proposal status, vote counts, and chat history.",
  "frontend/src/components/sections/EconomicModel.tsx": "Static informational page describing the Quantum Yield economic model, showing APY rates, staking pools, and benefits for holders, stakers, and liquidity providers.",
  "frontend/src/components/sections/GameArchitecture.tsx": "Static documentation page presenting the technical architecture of the AR game across tabbed views covering system overview, components, data flow, diagrams, and MVP scope.",
  "frontend/src/components/sections/GlobalDistribution.tsx": "Informational page showing simulated QMY token geographic distribution, pre-sale phases, distribution pool allocations, and vesting schedules using charts, progress bars, and cards.",
  "frontend/src/components/sections/GlobalStatus.tsx": "Displays global game statistics including registered players, planted/burned/redeemed QMY tokens, a daily XP line chart, a QMY distribution pie chart, and a top-10 player leaderboard using mock data.",
  "frontend/src/components/sections/GoldPaper.tsx": "Empty file with no content or exports.",
  "frontend/src/components/sections/GoogleMaps.tsx": "Empty file with no content or exports.",
  "frontend/src/components/sections/HomeSpaceBackground.tsx": "Renders an animated canvas space background with twinkling stars, wobbling planets with rings and glows, and periodically spawning comets.",
  "frontend/src/components/sections/HUD.tsx": "Main heads-up display component that handles Internet Identity authentication, triggers a welcome bonus modal on first login, and renders the home screen with user stats (XP, locked/unlocked QMY) and navigation actions.",
  "frontend/src/components/sections/Introduction.tsx": "Static informational section presenting the Quantumoney project's mission, vision, core values (security, transparency, innovation), and competitive differentials using cards and icons.",
  "frontend/src/components/sections/Inventory.tsx": "Displays a tabbed inventory UI showing mock collected creatures (with rarity colors), consumable items, and achievements; requires Internet Identity authentication to view.",
  "frontend/src/components/sections/LeafletMap.tsx": "Renders the Quantumoney world map by embedding a Leaflet/OpenStreetMap page via an iframe, with a loading spinner and an info overlay; requires authentication to access.",
  "frontend/src/components/sections/LeafletMapPage.tsx": "A map page component that embeds a Leaflet map via iframe, handles geolocation permissions, syncs player location via postMessage, and displays a gameplay HUD overlay. Requires authentication to access.",
  "frontend/src/components/sections/LeafletWorldMap.tsx": "Empty file with no content.",
  "frontend/src/components/sections/legal/HowItWorks.tsx": "Renders the 'How It Works' legal/informational page by mapping over sections from legalContent, displaying titles and content in a scrollable dark-themed layout.",
  "frontend/src/components/sections/legal/Mission.tsx": "Renders the Mission page using missionContent from legalContent, displaying sectioned text in a scrollable dark-themed layout identical in structure to other legal pages.",
  "frontend/src/components/sections/legal/PrivacyPolicy.tsx": "Renders the Privacy Policy page using privacyContent from legalContent, displaying sectioned text or lists in a scrollable dark-themed layout.",
  "frontend/src/components/sections/legal/Terms.tsx": "Renders the Terms of Service page using termsContent from legalContent, displaying sectioned text or lists in a scrollable dark-themed layout.",
  "frontend/src/components/sections/MapLibreWorld.tsx": "A wrapper component that renders StaticWorldMap for authenticated users, or an authentication-required card for unauthenticated users.",
  "frontend/src/components/sections/MapMundo.tsx": "Empty file with no content.",
  "frontend/src/components/sections/MapMundoLeaflet.tsx": "Renders a full-screen iframe embedding the Leaflet map and syncs AR interaction state (locked coins, captured monsters, spawns) to the iframe via postMessage on load and state changes.",
  "frontend/src/components/sections/MapView.tsx": "Empty file with no content.",
  "frontend/src/components/sections/MarketAnalysis.tsx": "A whitepaper-style section displaying market analysis with competitor comparison data, market growth bar charts, and key metrics cards for the QMY token.",
  "frontend/src/components/sections/MundoMap.tsx": "Empty file with no content.",
  "frontend/src/components/sections/Partnerships.tsx": "A whitepaper section listing strategic partners across DeFi, infrastructure, and ecosystem categories with cards and partnership strategy description.",
  "frontend/src/components/sections/Profile.tsx": "User profile page showing XP, QMY balances, captured monsters, and vesting schedule, with support for editing display name and uploading a profile photo via the backend actor.",
  "frontend/src/components/sections/Roadmap.tsx": "A whitepaper roadmap section rendering quarterly milestones from Q4 2025 through 2027+ with status icons and color-coded cards indicating completed, current, and upcoming phases.",
  "frontend/src/components/sections/RulesTutorial.tsx": "Displays a tabbed tutorial page for the Quantumoney AR game covering basics, QMY coin mechanics, and AR camera usage, with icon-accompanied info cards for each topic.",
  "frontend/src/components/sections/StaticWorldMap.tsx": "Renders a static world map image with overlaid player and spawn markers (coins/monsters), supporting layer toggles, location presets, and canister-backed collected/captured state.",
  "frontend/src/components/sections/SWAP.tsx": "Empty file with no content or exports.",
  "frontend/src/components/sections/TableOfContents.tsx": "Displays a navigable grid of cards linking to the main app sections (AR Camera, World Map, Profile, Rules & Tutorial) using a passed-in navigation callback.",
  "frontend/src/components/sections/TechnicalAppendix.tsx": "Shows a technical appendix with tabbed sections for mathematical formulas (staking rewards, burn rate, voting power, dynamic APY), specifications, and security details in Portuguese.",
  "frontend/src/components/sections/Technology.tsx": "Presents the technology stack in Portuguese via tabs covering ICP blockchain stats, Motoko smart contracts, interoperability, and scalability features.",
  "frontend/src/components/sections/Tokenomics.tsx": "Renders QMY token distribution (pie chart), release schedule (line chart), and burn mechanism details across three tabs using Recharts visualizations.",
  "frontend/src/components/sections/Vesting.tsx": "Dedicated vesting dashboard page displaying 700M QMY token unlock schedule with charts (line, pie, bar), a progress tracker, and a table of upcoming unlock events with copyable transaction hashes.",
  "frontend/src/components/sections/Wallet.tsx": "Empty file with no content or exports.",
  "frontend/src/components/SideDrawer.tsx": "Slide-in side drawer built with a Sheet component that lists gameplay and informational navigation items and provides a logout button for authenticated users.",
  "frontend/src/components/TermsModal.tsx": "Blocking full-screen modal that displays scrollable terms-of-service content and enables the Accept button only after the user scrolls to the end, storing acceptance in local storage.",
  "frontend/src/components/VestingBanner.tsx": "Empty file with no content.",
  "frontend/src/components/wallet/QmySendReceive.tsx": "UI component for sending and receiving QMY tokens via Login ID using tabbed send/receive forms; currently UI-only and simulated, with no real token transfers.",
  "frontend/src/components/WalletHUD.tsx": "Empty file with no content.",
  "frontend/src/components/WelcomeBanner.tsx": "Empty file with no content.",
  "frontend/src/components/WelcomeBonusModal.tsx": "Modal component that displays a welcome bonus breakdown (100 XP, 100 unlocked QMY, 900 locked QMY) with a 9-month vesting schedule grid, and invalidates relevant React Query caches on close.",
  "frontend/src/content/legalContent.ts": "Defines TypeScript interfaces and static content objects (terms, privacy policy, mission, how-it-works) used by the legal section components.",
  "frontend/src/contexts/GameStateContext.tsx": "React context provider that aggregates player state, vesting schedule, and bonus data from the ICP backend actor, exposing game state values and actions (e.g., triggerWelcomeBonus, isCoinLocked) to the component tree.",
  "frontend/src/contexts/GeolocationContext.tsx": "Provides a React context for managing browser geolocation, including permission state, position tracking via watchPosition, and error handling with user-friendly messages.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for i18n supporting English and Portuguese, with a translation lookup function and language persistence.",
  "frontend/src/contexts/ProximitySettingsContext.tsx": "Provides a React context for storing and persisting the user's proximity radius setting (10 or 20 meters) in localStorage.",
  "frontend/src/contexts/SimulatedLocationContext.tsx": "Provides a React context for a simulated GPS location with preset cities, directional movement, and sessionStorage persistence, used for testing without real GPS.",
  "frontend/src/gameplay/audio/useSfx.ts": "Custom hook that plays short sound effects (collect, spawn, levelup, capture) using the Web Audio API with mute support.",
  "frontend/src/gameplay/bonus/registrationBonus.ts": "Calculates a 1000 QMY registration bonus unlock schedule, releasing 100 initially and 100 per month over 9 months based on a registration timestamp in nanoseconds.",
  "frontend/src/gameplay/density/buildDensityZones.ts": "Groups geographic spots into a 0.5-degree grid and returns colored density zones normalized to the maximum bucket count.",
  "frontend/src/gameplay/fx/SpawnCollectFX.tsx": "Renders a brief animated overlay effect (emoji + XP text) for coin-lock, monster-capture, or level-up events, auto-dismissing after 1.5 seconds.",
  "frontend/src/gameplay/history/types.ts": "Defines TypeScript types for gameplay history events and computed player statistics such as coins collected, XP earned, and current level.",
  "frontend/src/gameplay/history/useGameplayHistory.ts": "Custom hook that stores and retrieves up to 100 per-user gameplay history events in localStorage, keyed by the user's principal.",
  "frontend/src/gameplay/progression/leveling.ts": "Provides XP-based leveling utilities including level calculation, level-up detection, XP progress percentage, and a rank label derived from XP thresholds.",
  "frontend/src/gameplay/spots/spotTaxonomy.ts": "Defines the unified spot type taxonomy for AR and map rendering, including definitions for coins and creatures with colors, icon paths, XP rewards, and helper accessors.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useArActions.ts": "Provides React Query mutation hooks for AR interactions—locking/unlocking coins and capturing monsters—calling the backend actor and updating local store and query cache on success.",
  "frontend/src/hooks/useArInteractions.ts": "Thin hook that exposes coin-locked and monster-captured state from the GameStateContext for use in AR components.",
  "frontend/src/hooks/useBetaQaChecklistOverrides.ts": "Hook for persisting beta QA checklist status overrides (pass/fail/pending with notes) to localStorage, with versioned storage and CRUD helpers.",
  "frontend/src/hooks/useGeolocation.ts": "Re-exports the geolocation hook from GeolocationContext as a simple named hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY AuthClient, providing a React context and hook with login/logout, identity state, and login status tracking.",
  "frontend/src/hooks/usePlayerState.ts": "React Query hook that fetches player state from the backend actor and syncs locked coins and captured monsters into the local arInteractionsStore.",
  "frontend/src/hooks/usePlugWallet.ts": "Empty file with no implementation.",
  "frontend/src/hooks/usePrototypeDetection.ts": "Hook that performs lightweight frame-by-frame motion and brightness variance analysis on a video element to produce a simple object detection confidence score.",
  "frontend/src/hooks/useQmySync.ts": "Provides React Query hooks for reading QMY/player state from the canister, manually refreshing sync data, and UI-only send/receive QMY mutations.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profile, player state, claim bonus, vesting schedule, and a combined sync query.",
  "frontend/src/hooks/useShareReward.ts": "Empty file with no content.",
  "frontend/src/hooks/useSpawnList.ts": "Fetches the list of spawn items from the actor, falling back to mock data if the actor is unavailable or returns empty results.",
  "frontend/src/hooks/useVisualRewardSimulation.ts": "Simulates a vesting reward schedule client-side using localStorage to track registration date, calculating unlocked/locked token amounts and next unlock timing.",
  "frontend/src/hooks/useWalkingMeters.ts": "Tracks cumulative walking distance in meters from GPS coordinates, filtering out jitter and unrealistic speed jumps using throttled position updates.",
  "frontend/src/i18n/config.ts": "Empty file with no content.",
  "frontend/src/i18n/locales/en.json": "English locale strings for the app covering navigation, camera, map, monsters, and common UI labels.",
  "frontend/src/i18n/locales/es.json": "Empty file with no content.",
  "frontend/src/i18n/locales/pt.json": "Portuguese locale strings mirroring the English locale, including additional Plug Wallet-specific translations.",
  "frontend/src/index.css": "Global CSS file defining the OKLCH-based gold/dark design token system, Tailwind imports, and utility classes for glass cards, gold colors, and safe area support.",
  "frontend/src/lib/arInteractionsStore.ts": "localStorage-backed store for caching AR coin lock and monster capture states, with methods to read, write, sync from canister data, and clear the cache.",
  "frontend/src/lib/haversine.ts": "Provides utility functions for geographic distance calculations using the Haversine formula, including distance in meters/kilometers and a radius check.",
  "frontend/src/lib/mockGameplayState.ts": "Client-side localStorage cache for player gameplay state (XP, coins, monsters) used as a fallback when the canister is unreachable; syncs from authoritative canister PlayerState.",
  "frontend/src/lib/mockSpawns.ts": "Defines hardcoded fallback spawn items (coins and monsters) and a helper to filter spawns within a given radius of a geographic position.",
  "frontend/src/lib/qmyApi.ts": "Visual-only fallback API module that caches QMY balance, XP, and history in localStorage; all real data comes from the canister, and transfer functions return stub responses.",
  "frontend/src/lib/qmyLocking.ts": "Local localStorage-based cache for QMY coin lock records, providing functions to lock coins, resolve matured locks, and retrieve lock data for a principal.",
  "frontend/src/lib/termsAcceptance.ts": "Centralized utility for managing Terms acceptance state in localStorage under a single key, with migration support from legacy keys.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/conceptualWallet.ts": "Generates a deterministic wallet ID from a principal using SHA-256 hashing and provides placeholder transaction data for visual display.",
  "frontend/src/utils/qaChecklistExport.ts": "Builds and exports QA checklist reports as JSON, supporting clipboard copy and file download with pass/fail/pending totals.",
  "frontend/src/utils/share.ts": "Client-side share helper that attempts the Web Share API first, then falls back to clipboard copy for sharing title, text, and URL.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings and hash-based routes, with sessionStorage persistence and helpers to clear params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based semantic colors, gold accent colors/shadows, Orbitron/Inter/JetBrains Mono fonts, custom breakpoints, safe-area spacing, and animations. Includes plugins for tailwindcss-animate, @tailwindcss/typography, and @tailwindcss/container-queries.",
  "frontend/TECHNICAL_VERIFICATION_REPORT.md": "Technical verification report confirming Quantumoney AR's data persistence architecture (ICP canisters, three-tier storage) is production-ready for Capacitor 6+ native mobile packaging. Documents canister IDs, stored data types, and persistence guarantees.",
  "project_state.json": "Project state descriptor (version 11) for the QuantumMoneyAR PWA game, documenting architecture, canister IDs, known issues, existing features, and requirements such as real ICP canister integration, AR lock/unlock mechanics, XP system, and Internet Identity authentication.",
  "unknown.txt": "Portuguese-language design document outlining detailed game flows (login, collection, governance, transactions), MVP features, backend data structures, and core backend operations for the AR blockchain game."
}