{
  "kind": "build_request",
  "title": "Unify authentication and canisters between quantumoneyar.app and quantumoney.app",
  "projectName": "Quantumoney AR",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Configure Internet Identity authentication in quantumoneyar.app to use exclusively identity.ic0.app as the identity provider — the same provider used by quantumoney.app — so that logging in with the same Internet Identity account on both domains produces the exact same Principal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "a aplicação quantumoneyar.app não está a usar os mesmos canisters do quantumoney.app, eu quero apenas o mesmo perfil para ambos os sites"
        ]
      },
      "acceptanceCriteria": [
        "The AuthClient in quantumoneyar.app is initialized with identityProvider set to https://identity.ic0.app",
        "No alternative identity provider, local identity generation, or previously stored session identity is used",
        "After login, the Principal displayed in quantumoneyar.app matches the Principal displayed in quantumoney.app for the same Internet Identity account",
        "Any previously cached identity or localStorage session data from a different provider is cleared on app load"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Point all backend canister calls in quantumoneyar.app to the same canisters used by quantumoney.app: Frontend/Website crjop-jyaaa-aaaah-atfaq-cai, Gold Paper & Docs whu4t-kiaaa-aaaah-qsc5q-cai, Governance/Treasury nemlr-6aaaa-aaaan-q32la-cai, Logic ckmsk-taaaa-aaaah-atfca-cai, QMY Ledger 5o54h-giaaa-aaaad-aentq-cai. Remove or override any hardcoded canister IDs that differ from these values.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "QMY Frontend / Website: crjop-jyaaa-aaaah-atfaq-cai",
          "QMYledger token standard: 5o54h-giaaa-aaaad-aentq-cai",
          "QMY Governance/Treasury: nemlr-6aaaa-aaaan-q32la-cai",
          "QMY Logic (conceitual..): ckmsk-taaaa-aaaah-atfca-cai",
          "QMY Gold Paper & Docs: whu4t-kiaaa-aaaah-qsc5q-cai"
        ]
      },
      "acceptanceCriteria": [
        "All canister ID constants in the frontend configuration match the five canonical IDs listed above",
        "No other canister IDs are used anywhere in the codebase for actor creation or API calls",
        "The useActor hook creates actors targeting these canister IDs",
        "Profile, XP, QMY balance, and gameplay history are loaded from these shared canisters"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Clear all stale identity and session data (localStorage keys related to identity, principal, and session) on app initialization in quantumoneyar.app, then force a fresh Internet Identity login so no outdated principal from a previous misconfigured session persists.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "não pode haver 2 perfis quando se efetuar login com o mesmo ID"
        ]
      },
      "acceptanceCriteria": [
        "On first load after this change, any localStorage/sessionStorage entries tied to a previous identity session are removed",
        "Users are prompted to log in again via Internet Identity if a stale session is detected",
        "After re-authentication, the profile, XP, QMY balance, and history shown in quantumoneyar.app are identical to those shown in quantumoney.app for the same account"
      ]
    }
  ],
  "constraints": [
    "Do not change the layout, visual design, or any feature modules",
    "Do not alter the backend/main.mo canister logic",
    "Do not introduce any authentication method other than Internet Identity (identity.ic0.app)",
    "The five canister IDs provided by the user must be used exactly as given — do not invent or substitute IDs"
  ],
  "nonGoals": [
    "Merging the two Caffeine projects into a single deployment",
    "Creating or modifying any ICP canister smart contract code",
    "Adding new UI screens or features",
    "Implementing the QMY cryptocurrency wallet creation flow"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}