{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Unify authentication and canisters between quantumoneyar.app and quantumoney.app",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Configure Internet Identity authentication to use identity.ic0.app exclusively",
      "acceptanceCriteria": [
        "The AuthClient in quantumoneyar.app is initialized with identityProvider set to https://identity.ic0.app",
        "No alternative identity provider, local identity generation, or previously stored session identity is used",
        "After login, the Principal displayed in quantumoneyar.app matches the Principal displayed in quantumoney.app for the same Internet Identity account",
        "Any previously cached identity or localStorage session data from a different provider is cleared on app load"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Modify the AuthClient initialization to explicitly set identityProvider to 'https://identity.ic0.app' in the login method. Remove any fallback identity providers or local identity generation. Ensure derivationOrigin is not set or is consistent with quantumoney.app configuration. Clear any stale identity/session data from localStorage before initializing AuthClient."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Add an initialization step before mounting the React app that clears stale identity-related localStorage keys (e.g., keys prefixed with 'ic-identity-', 'ic-delegation-', or any legacy authentication keys). This ensures no outdated principal from a previous misconfigured session persists across app loads."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Point all backend canister calls to the shared canisters used by quantumoney.app",
      "acceptanceCriteria": [
        "All canister ID constants in the frontend configuration match the five canonical IDs listed above",
        "No other canister IDs are used anywhere in the codebase for actor creation or API calls",
        "The useActor hook creates actors targeting these canister IDs",
        "Profile, XP, QMY balance, and gameplay history are loaded from these shared canisters"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Replace any hardcoded canister IDs in the actor creation logic with the canonical IDs: Frontend/Website crjop-jyaaa-aaaah-atfaq-cai, Gold Paper & Docs whu4t-kiaaa-aaaah-qsc5q-cai, Governance/Treasury nemlr-6aaaa-aaaan-q32la-cai, Logic ckmsk-taaaa-aaaah-atfca-cai, QMY Ledger 5o54h-giaaa-aaaad-aentq-cai. Ensure the createActor or actor initialization function uses the Logic canister ID (ckmsk-taaaa-aaaah-atfca-cai) as the primary backend canister for all gameplay and profile operations."
        },
        {
          "path": "frontend/capacitor.config.json",
          "operation": "modify",
          "description": "Update the server.url configuration if it references a canister ID directly, ensuring it points to the correct network endpoint that resolves to the shared canisters. Verify that any hardcoded canister references in plugin configurations are removed or updated to match the canonical IDs."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Clear stale identity and session data on app initialization and force fresh Internet Identity login",
      "acceptanceCriteria": [
        "On first load after this change, any localStorage/sessionStorage entries tied to a previous identity session are removed",
        "Users are prompted to log in again via Internet Identity if a stale session is detected",
        "After re-authentication, the profile, XP, QMY balance, and history shown in quantumoneyar.app are identical to those shown in quantumoney.app for the same account"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Add logic to detect stale sessions (e.g., by checking a version flag in localStorage or comparing stored identity provider URLs). If a stale session is detected, clear all identity-related localStorage keys and call AuthClient.logout() before prompting the user to log in again. Ensure the clear() method also removes any cached principal or delegation data."
        },
        {
          "path": "frontend/src/lib/arInteractionsStore.ts",
          "operation": "modify",
          "description": "Add a method to clear all cached AR interaction data (locked coins, captured monsters) when the user logs out or when a stale session is detected. Invoke this method from the InternetIdentity clear() or logout flow to ensure no orphaned data from a previous principal persists."
        },
        {
          "path": "frontend/src/lib/mockGameplayState.ts",
          "operation": "modify",
          "description": "Add a clearAll() method that removes all cached gameplay state from localStorage. Call this method during logout or stale session cleanup to ensure the next login fetches fresh data from the shared canisters."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Extend the initialization step to also clear any cached gameplay state (arInteractionsStore, mockGameplayState, qmyApi caches) if stale identity data is detected. This ensures a clean slate before the user re-authenticates with Internet Identity."
        }
      ]
    }
  ]
}