{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "QuantumoneyAR final sync: profile photo, monster XP, home background, footer ICP reference",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Add profile photo upload and display for authenticated users using the blob-storage component",
      "acceptanceCriteria": [
        "An 'Edit Photo' button is visible on the Profile page for authenticated users.",
        "Clicking the button opens a file picker limited to image types.",
        "The selected image is uploaded to the backend and persisted per principal.",
        "The profile photo is displayed in Profile.tsx and in the Header auth dropdown.",
        "If no photo is set, a default avatar placeholder is shown.",
        "Photo changes made in the app are reflected on next load without a hard refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/Profile.tsx",
          "operation": "modify",
          "description": "Add profile photo display and upload functionality in the Profile Overview tab. Use the blob-storage component to handle photo uploads via ExternalBlob.fromBytes() with progress tracking. Display the photo from userProfile.photoUrl using getDirectURL() if available, otherwise show the generated default avatar image from frontend/public/assets/generated/avatar-default.dim_128x128.png. Add an 'Edit Photo' button that opens a file input limited to image/* types. When a photo is selected, convert it to bytes, create an ExternalBlob, upload it with progress tracking, then call saveCallerUserProfile mutation to persist the updated profile. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update the auth dropdown to display the user's profile photo. Fetch the current user profile using getCallerUserProfile and display the photo using photoUrl?.getDirectURL() if available, otherwise show the default avatar from frontend/public/assets/generated/avatar-default.dim_128x128.png. Ensure the photo is displayed as a small circular thumbnail next to the user's name/balances in the dropdown. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the useCallerUserProfile query hook properly handles the photoUrl field of type ExternalBlob from the backend interface. No special query logic needed beyond what's already present, but verify that the UserProfile type includes the optional photoUrl field."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Award +20 XP for monster rescue in AR camera view and reflect in GameStateContext and Profile",
      "acceptanceCriteria": [
        "Rescuing a monster in the AR view triggers a +20 XP backend mutation.",
        "The XP increase is reflected immediately in the Header auth dropdown balance display.",
        "The Profile page XP counter updates after a monster rescue without requiring a manual refresh.",
        "The +20 XP delta is consistent whether the monster is rescued via the AR Rescue button or any equivalent action.",
        "The gameplay history event added via useGameplayHistory records the +20 XP gain."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/CameraAR/CameraARActionBar.tsx",
          "operation": "modify",
          "description": "Add a monster rescue button that triggers when a monster is within proximity. On rescue, add a gameplay history event via useGameplayHistory with type 'creature-capture' and xpGained: 20. The backend mutation for monster capture should already update XP; ensure the frontend invalidates the playerState query after rescue to refresh XP in the UI. Display a toast notification confirming +20 XP gain. Coordinate with the GameStateContext refresh mechanism to ensure the Header and Profile reflect the new XP immediately."
        },
        {
          "path": "frontend/src/contexts/GameStateContext.tsx",
          "operation": "modify",
          "description": "Ensure the GameStateContext auto-refreshes player state (including XP) when window focus is regained and after monster capture mutations. Verify that the refresh function invalidates the playerState query so that the Header and Profile page XP counters update immediately after a monster rescue without requiring a manual page refresh."
        },
        {
          "path": "frontend/src/gameplay/history/useGameplayHistory.ts",
          "operation": "modify",
          "description": "Ensure the addEvent function supports creature-capture events with an xpGained field set to 20. Verify that the event is persisted to localStorage and displayed in the Profile page gameplay history."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Activate the HomeSpaceBackground canvas on the HUD/Home section with twinkling stars, planets, comets, and floating ICP/QMY coins",
      "acceptanceCriteria": [
        "The HOME / HUD section renders the HomeSpaceBackground canvas as a full-screen fixed backdrop.",
        "Stars twinkle, planets float, and comets animate across the canvas.",
        "Golden ICP and QMY coin images drift smoothly across the screen.",
        "The animation runs without blocking UI interaction on top of it.",
        "The background is not visible on other pages (AR, Map, Profile, etc.)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/HUD.tsx",
          "operation": "modify",
          "description": "Import and render the HomeSpaceBackground component as a full-screen fixed backdrop behind all other HUD content. Ensure it is positioned with fixed positioning and z-index lower than interactive UI elements so it does not block user interaction. The component should only render when the HUD section is active."
        },
        {
          "path": "frontend/src/components/sections/HomeSpaceBackground.tsx",
          "operation": "modify",
          "description": "Enhance the existing canvas animation to include floating golden ICP and QMY coin images. Load the generated coin images from frontend/public/assets/generated/icp-coin-gold.dim_128x128.png and frontend/public/assets/generated/qmy-coin-gold.dim_128x128.png. Render these coins drifting slowly across the canvas using smooth motion paths. Ensure stars twinkle, planets float, and comets animate continuously. The canvas should be a full-screen fixed backdrop with pointer-events: none to allow interaction with overlaid UI elements."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add ICP cryptocurrency reference to Footer component alongside social share links",
      "acceptanceCriteria": [
        "The Footer component displays the ICP logo/icon and a 'Powered by ICP' label.",
        "The ICP reference is displayed alongside (not replacing) the four social share links.",
        "No Caffeine branding appears anywhere in the footer.",
        "The footer remains compact and does not overlap the bottom navigation bar.",
        "The ICP logo links to the Internet Computer official website (https://internetcomputer.org)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add an ICP reference section to the Footer component. Display the ICP logo from frontend/public/assets/generated/icp-coin-gold.dim_128x128.png alongside a 'Powered by ICP' text label. Link the logo and label to https://internetcomputer.org with target='_blank' and rel='noopener noreferrer'. Position the ICP reference next to the existing social share links (WhatsApp, X, Telegram, Instagram) without replacing them. Ensure no Caffeine branding is present. Keep the footer compact in height so it does not overlap the bottom navigation bar."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Display and enable inline editing of player username/display name on Profile page, synced with Quantumoney.app via Internet Identity",
      "acceptanceCriteria": [
        "The Profile page shows the authenticated user's display name fetched from the backend.",
        "The display name defaults to the one already set on Quantumoney.app for the same principal.",
        "An inline edit control allows changing the display name.",
        "Saving the new name persists it to the backend actor via a mutation.",
        "The updated name is visible in the Header auth dropdown after saving."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/Profile.tsx",
          "operation": "modify",
          "description": "In the Profile Overview tab, display the user's display name from the userProfile.name field fetched via getCallerUserProfile. Add an inline edit control (e.g., an edit icon button or double-click to edit) that allows the user to change the display name. When the user saves the new name, call the saveCallerUserProfile mutation with the updated profile object. After saving, invalidate the userProfile query so the Header auth dropdown reflects the updated name immediately. Use a text input with save/cancel buttons or an inline editable field component."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Ensure the auth dropdown displays the user's display name from the fetched userProfile.name field. After the Profile page updates the name via saveCallerUserProfile, the Header should automatically reflect the change when the userProfile query is invalidated and refetched. No direct changes to Header logic are required beyond ensuring it consumes the latest userProfile data."
        }
      ]
    }
  ]
}