{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Profile UI bugs: Coins Captured count, XP bar visual, and canister ID links",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix 'Coins Captured' stat display in Profile page to show real canister balance instead of defaulting to 0",
      "acceptanceCriteria": [
        "Profile page shows '1000 QMY' (or the real canister balance) under 'Coins Captured' / 'Moedas Capturadas'",
        "Value never falls back to '0' when a real wallet balance is available",
        "Fallback chain: canister coins → walletBalance → 0"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/Profile.tsx",
          "operation": "modify",
          "description": "Update the 'Coins Captured' / 'Moedas Capturadas' stat display logic to use `userStats.coins || walletBalance` instead of `userStats.coins || 0`. Locate the Game Stats section where coins are displayed and ensure the value reads from playerState data with proper fallback to walletBalance before defaulting to 0. The field must show the real QMY balance (e.g., '1000 QMY') when available."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix XP progress bar visual fill to accurately reflect current XP percentage relative to next level threshold",
      "acceptanceCriteria": [
        "XP bar width is computed as Math.min((currentXP / nextLevelXP) * 100, 100) percent",
        "With XP=100 and next threshold=900, bar is visually ~11% filled",
        "Bar is never 0% wide when currentXP > 0"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/Profile.tsx",
          "operation": "modify",
          "description": "Fix the XP progress bar rendering in the Profile page so it computes the visual fill percentage correctly. The bar width should be calculated as `Math.min((currentXP / nextLevelXP) * 100, 100)` and applied to the bar's style or className. Ensure when XP=100 and nextLevelXP=900, the bar renders at approximately 11% width. The bar must never appear empty (0% width) when currentXP > 0."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix canister ID links in Profile page to display full IDs without truncation and link to ICScan URLs",
      "acceptanceCriteria": [
        "All five canister IDs are displayed in full without ellipsis or truncation",
        "Each canister ID is wrapped in an anchor tag with href='https://icscan.io/canister/<id>' and target='_blank'",
        "Canister labels (Frontend, Ledger QMY, Logic, Docs, Governance) are shown alongside each ID",
        "Links are styled to be readable on dark background (gold or light accent color)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/Profile.tsx",
          "operation": "modify",
          "description": "Fix the Carteira A canister ID display section in the Profile page. Replace any truncated or shortened canister ID text with full IDs: Frontend (crjop-jyaaa-aaaah-atfaq-cai), Ledger QMY (5o54h-giaaa-aaaad-aentq-cai), Logic (ckmsk-taaaa-aaaah-atfca-cai), Docs (whu4t-kiaaa-aaaah-qsc5q-cai), Governance (nemlr-6aaaa-aaaan-q32la-cai). Wrap each canister ID in an anchor tag with href='https://icscan.io/canister/<canister-id>' and target='_blank' rel='noopener noreferrer'. Apply gold or light accent color styling (text-yellow-400 or text-amber-400) for readability on dark background. Include the label (Frontend, Ledger QMY, Logic, Docs, Governance) before each clickable ID. Ensure no CSS text-overflow ellipsis is applied to these links."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure Game Stats section displays Coins Captured, Total QMY, and Monsters fields with correct values",
      "acceptanceCriteria": [
        "Game Stats section shows 'Coins Captured', 'Total QMY', and 'Monsters' fields",
        "'Total QMY' reflects the QMY Ledger balance (5o54h-giaaa-aaaad-aentq-cai)",
        "'Monsters' shows captured/total format (e.g. '0/50')",
        "Section is visible without requiring scroll when on desktop and is accessible on mobile"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/Profile.tsx",
          "operation": "modify",
          "description": "Verify and ensure the Game Stats section in the Profile page displays all three required fields: 'Coins Captured' (using canister coins or walletBalance), 'Total QMY' (showing the QMY Ledger balance from canister 5o54h-giaaa-aaaad-aentq-cai, e.g., '1000 QMY'), and 'Monsters' (in captured/total format like '0/50'). Ensure the section is positioned high enough in the layout to be visible on desktop without scrolling, and remains accessible on mobile viewports. If any of these fields are missing or incorrectly populated, add or update the rendering logic to pull from playerState and display the values correctly."
        }
      ]
    }
  ]
}