{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "AR-based game app (quantumoneyar.app / quantumoney.app) where players lock/unlock coins and rescue monsters distributed on a map using AR camera features.",
  "architectural_notes": [
    "App uses AR camera features for gameplay (lock/unlock coins, rescue monsters on map)",
    "Two linked properties: app at https://quantumoneyar.app and site at https://quantumoney.app"
  ],
  "known_issues": [
    "Lock and unlock buttons in AR are currently inactive/non-functional"
  ],
  "isFixRequest": false,
  "existing_features": [],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Activate lock and unlock buttons in AR so players can lock/unlock coins and rescue monsters marked on the map",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Move footers higher on all pages without scrolling the pages up; remove all references to 'Caffeine' from footers",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Activate the Lock and Unlock buttons in the AR camera view (CameraARActionBar) so that players can trigger lock and unlock coin interactions on visible AR spawn objects. The buttons must call the existing useLockCoin and useUnlockCoin mutations from useArActions.ts, passing the correct spawn/coin ID. Show loading states during the async call, and reflect the updated lock state on the overlay sprite via useArInteractions. On success, persist the new lock state via arInteractionsStore and sync the local mockGameplayState.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Enable monster rescue in the AR camera view. When a monster spawn is visible and in range in the AR overlay, allow the player to interact with it (via the existing action bar or a dedicated 'Rescue' button) to capture/rescue the monster. On rescue, call the appropriate backend mutation, update the monster's captured state in mockGameplayState, and add a gameplay history event of type 'creature-capture' via useGameplayHistory. Show a SpawnCollectFX visual effect on successful rescue.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Ensure the spawn markers displayed on the Leaflet map (/map/index.html and LeafletMapPage / MapMundoLeaflet components) reflect the current lock state and monster rescue state from localStorage (arInteractionsStore / mockGameplayState), so that coins and monsters already interacted with in AR are visually marked as locked/captured on the map.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Move the footer visually higher on all pages throughout the application (including HUD, Profile, Map, AR, legal pages, and any other pages that have a footer) by reducing bottom padding/margin so the footer is closer to the last content section, without scrolling page content upward or changing page layout. The footer must remain at the bottom of its container but with less dead space below content.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Remove all references to 'Caffeine' (including the word 'Caffeine', any 'Built with Caffeine', 'Powered by Caffeine', or similar attributions) from the footer component (Footer.tsx) and from any other footer or page-level attribution text across the entire application.",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "QuantumMoneyAR",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}